vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MIMXRT758S_DFP.pdsc
                Message(0, "Configure Trace clock");
                Write32(TPIUFCLKSEL_ADDR, 0x4 | traceClkSrc);   // Enable and configure trace clock
                divider = Read32(TPIUCLKDIV_ADDR);
                Write32(TPIUCLKDIV_ADDR, 0x20000000); //Reset divider
                Write32(TPIUCLKDIV_ADDR, traceClkDiv-1);
              </block>
              <control while="(Read32(TPIUCLKDIV_ADDR) &amp; 0x80000000) ==0" timeout="50000"/>
              <block>
                Write32(TRACECLKEN_ADDR, 0x1C);
                //Enable the clock for the IOPCTL1 block
                Write32(PSCCTL0_SET_ADDR, 0x1000000);
                //Clear reset of the IOPCTL1 block
                Write32(PRSTCTL0_CLR_ADDR, 0x1);
                //Configure SWO pin
                Write32(SWO_IOPCTL_ADDR, 0x5U);
              </block>
            </control>
          </sequence>
          <sequence name="ResetSystem" Pname="cm33_core0">
            <block>
              __dp = 0;
              __ap = 0;
              // System Control Space (SCS) offset as defined in Armv6-M/Armv7-M.
              __var SCS_Addr   = 0xE000E000;
              __var AIRCR_Addr = SCS_Addr + 0xD0C;
              __var DHCSR_Addr = SCS_Addr + 0xDF0;
              __var DEMCR_Addr = SCS_Addr + 0xDFC;
              __var tmp;
              //Halt the core
              Write32(DHCSR_Addr, 0xA05F0003);
              //clear VECTOR CATCH and set TRCENA
              tmp = Read32(DEMCR_Addr);
              Write32(DEMCR_Addr, tmp | 0x1000000);
              // Set watch point at SYSTEM_STICK_CALIB access
              Write32(0xE0001020, 0x50002094);
              Write32(0xE0001028, 0x00000814);
              __errorcontrol = 1;
              // Execute SYSRESETREQ via AIRCR
              Write32(AIRCR_Addr, 0x05FA0004);
              DAP_Delay(BootTime);  // Give bootloader time to do what it needs to do
              Sequence("WaitForStopAfterReset");
              __errorcontrol = 0;
            </block>
          </sequence>
          <sequence name="ResetSystem" Pname="cm33_core1" disable="1">
            <block>Message(0, "CPU1 doesn't support reset system");</block>
          </sequence>
        </sequences>
        <debugvars configfile="devices/MIMXRT758S/arm/MIMXRT7xx.dbgconf">
          // Debug Access Variables, can be modified by user via copies of DBGCONF files as created by uVision. Also see sub-family level.
          __var Dbg_CR                = 0x00000000;           // DBG_CR
          __var BootTime              = 50000;                // 50 milliseconds
          __var traceClkSrc           = 0;                    // Trace clock source
          __var traceClkDiv           = 2;                    // Trace clock divider by
        </debugvars>
        <memory name="BootROM" start="0x03000000" size="0x040000" access="rx" default="1"/>
        <memory name="BootROM_alias" start="0x13000000" size="0x040000" access="rx" alias="BootROM"/>
        <memory name="SRAM_CMPT" start="0x00080000" size="0x500000" access="rw" default="1"/>
        <memory name="SRAM_CMPT_alias1" start="0x10080000" size="0x500000" access="rw" alias="SRAM_CMPT"/>
        <memory name="SRAM_CMPT_alias2" start="0x20080000" size="0x500000" access="rw" alias="SRAM_CMPT"/>
        <memory name="SRAM_CMPT_alias3" start="0x30080000" size="0x500000" access="rw" alias="SRAM_CMPT"/>
        <memory name="SRAM_HIFI1" start="0x00680000" size="0x100000" access="rw" default="1"/>
        <memory name="SRAM_HIFI1_alias1" start="0x10680000" size="0x100000" access="rw" alias="SRAM_HIFI1"/>
        <memory name="SRAM_HIFI1_alias2" start="0x20680000" size="0x100000" access="rw" alias="SRAM_HIFI1"/>
        <memory name="SRAM_HIFI1_alias3" start="0x30680000" size="0x100000" access="rw" alias="SRAM_HIFI1"/>
        <memory name="SRAM_SENSE" start="0x00580000" size="0x100000" access="rw" default="1"/>
        <memory name="SRAM_SENSE_alias1" start="0x10580000" size="0x100000" access="rw" alias="SRAM_SENSE"/>
        <memory name="SRAM_SENSE_alias2" start="0x20580000" size="0x100000" access="rw" alias="SRAM_SENSE"/>
        <memory name="SRAM_SENSE_alias3" start="0x30580000" size="0x100000" access="rw" alias="SRAM_SENSE"/>
        <memory name="SRAM_SHARED" start="0x00000000" size="0x080000" access="rw" default="1"/>
        <memory name="SRAM_SHARED_alias1" start="0x10000000" size="0x080000" access="rw" alias="SRAM_SHARED"/>
        <memory name="SRAM_SHARED_alias2" start="0x20000000" size="0x080000" access="rw" alias="SRAM_SHARED"/>
        <memory name="SRAM_SHARED_alias3" start="0x30000000" size="0x080000" access="rw" alias="SRAM_SHARED"/>
        <algorithm name="devices/MIMXRT758S/arm/MIMXRT700_EVK_XSPI0.FLM" start="0x28000000" size="0x04000000" RAMstart="0x30020000" RAMsize="0x00008000" default="1" Pname="cm33_core0"/>
        <algorithm name="devices/MIMXRT758S/arm/MIMXRT700_EVK_XSPI0_S.FLM" start="0x38000000" size="0x04000000" RAMstart="0x30020000" RAMsize="0x00008000" default="1" Pname="cm33_core0"/>
        <algorithm name="devices/MIMXRT758S/arm/MIMXRT700_EVK_XSPI1.FLM" start="0x08000000" size="0x04000000" RAMstart="0x30020000" RAMsize="0x00008000" default="1" Pname="cm33_core0"/>
        <algorithm name="devices/MIMXRT758S/arm/MIMXRT700_EVK_XSPI1_S.FLM" start="0x18000000" size="0x04000000" RAMstart="0x30020000" RAMsize="0x00008000" default="1" Pname="cm33_core0"/>
        <debug svd="devices/MIMXRT758S/MIMXRT758S_cm33_core0.xml" Pname="cm33_core0" __dp="0" __ap="0"/>
        <debug svd="devices/MIMXRT758S/MIMXRT758S_cm33_core1.xml" Pname="cm33_core1" __dp="0" __ap="1"/>
        <variant Dvariant="MIMXRT758SGFOB">
          <compile Pname="cm33_core0" header="devices/MIMXRT758S/fsl_device_registers.h" define="CPU_MIMXRT758SGFOB_cm33_core0"/>
          <compile Pname="cm33_core1" header="devices/MIMXRT758S/fsl_device_registers.h" define="CPU_MIMXRT758SGFOB_cm33_core1"/>
        </variant>
        <variant Dvariant="MIMXRT758SGAWBR">
          <compile Pname="cm33_core0" header="devices/MIMXRT758S/fsl_device_registers.h" define="CPU_MIMXRT758SGAWBR_cm33_core0"/>
          <compile Pname="cm33_core1" header="devices/MIMXRT758S/fsl_device_registers.h" define="CPU_MIMXRT758SGAWBR_cm33_core1"/>
        </variant>
      </device>
    </family>
  </devices>
  <conditions>
    <condition id="device.MIMXRT758S.internal_condition">
      <accept Dname="MIMXRT758SGAWAR" Dvendor="NXP:11"/>
      <accept Dname="MIMXRT758SGAWBR" Dvendor="NXP:11"/>
      <accept Dname="MIMXRT758SGFOA" Dvendor="NXP:11"/>
      <accept Dname="MIMXRT758SGFOB" Dvendor="NXP:11"/>
    </condition>
    <condition id="cmake_toolchain.condition_id">
      <require condition="allOf.device=MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="allOf.device=MIMXRT758S.internal_condition">
      <require condition="device.MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="component.ak4497_adapter.condition_id">
      <require condition="allOf.device=MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="component.at_least_one_i2c_mux_device_enabled.condition_id">
      <require condition="allOf.component.i2c_mux_pca954x, device=MIMXRT758S.internal_condition"/>
    </condition>
