vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MIMXRT758S_DFP.pdsc
    <condition id="allOf.component.i2c_mux_pca954x, device=MIMXRT758S.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="i2c_mux_pca954x"/>
      <require condition="device.MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="component.audio_sai_edma_adapter.condition_id">
      <require condition="allOf.driver.sai_edma, device=MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="allOf.driver.sai_edma, device=MIMXRT758S.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="sai_edma"/>
      <require condition="device.MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="component.cmsis_drivers.condition_id">
      <require condition="allOf.device=MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="component.codec_adapters.condition_id">
      <require condition="allOf.device=MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="component.codec_i2c.condition_id">
      <require condition="allOf.component.i2c_adapter_interface, device=MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="allOf.component.i2c_adapter_interface, device=MIMXRT758S.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="i2c_adapter_interface"/>
      <require condition="device.MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="component.cs42448_adapter.condition_id">
      <require condition="allOf.device=MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="component.cs42888_adapter.condition_id">
      <require condition="allOf.device=MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="component.ctimer_adapter.condition_id">
      <require condition="allOf.driver.ctimer, device=MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="allOf.driver.ctimer, device=MIMXRT758S.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="ctimer"/>
      <require condition="device.MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="component.da7212_adapter.condition_id">
      <require condition="allOf.device=MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="device_id.MIMXRT758S.internal_condition">
      <accept Dname="MIMXRT758SGAWAR" Dvendor="NXP:11"/>
      <accept Dname="MIMXRT758SGAWBR" Dvendor="NXP:11"/>
      <accept Dname="MIMXRT758SGFOA" Dvendor="NXP:11"/>
      <accept Dname="MIMXRT758SGFOB" Dvendor="NXP:11"/>
    </condition>
    <condition id="component.els_pkc.condition_id">
      <require condition="allOf.anyOf=allOf=anyOf=device_id=MIMXRT758S, component.els_pkc.doc.mimxrt, component.els_pkc.key_derivation, component.els_pkc.oscca, component.els_pkc.platform.mimxrt, component.els_pkc.random_modes_ctr, component.els_pkc.random_modes_hmacdrbg, component.els_pkc.rsa_oaep, component.els_pkc.static_lib.mimxrt, component.els_pkc.els, component.els_pkc.pkc, component.els_pkc.trng.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=allOf=anyOf=device_id=MIMXRT758S, component.els_pkc.doc.mimxrt, component.els_pkc.key_derivation, component.els_pkc.oscca, component.els_pkc.platform.mimxrt, component.els_pkc.random_modes_ctr, component.els_pkc.random_modes_hmacdrbg, component.els_pkc.rsa_oaep, component.els_pkc.static_lib.mimxrt, component.els_pkc.els, component.els_pkc.pkc, component.els_pkc.trng.internal_condition">
      <require condition="anyOf.allOf=anyOf=device_id=MIMXRT758S, component.els_pkc.doc.mimxrt, component.els_pkc.key_derivation, component.els_pkc.oscca, component.els_pkc.platform.mimxrt, component.els_pkc.random_modes_ctr, component.els_pkc.random_modes_hmacdrbg, component.els_pkc.rsa_oaep, component.els_pkc.static_lib.mimxrt.internal_condition"/>
      <require Cclass="MIMXRT758S els_pkc" Cgroup="els_pkc_els"/>
      <require Cclass="MIMXRT758S els_pkc" Cgroup="els_pkc_pkc"/>
      <require Cclass="MIMXRT758S els_pkc" Cgroup="els_pkc_trng"/>
    </condition>
    <condition id="anyOf.allOf=anyOf=device_id=MIMXRT758S, component.els_pkc.doc.mimxrt, component.els_pkc.key_derivation, component.els_pkc.oscca, component.els_pkc.platform.mimxrt, component.els_pkc.random_modes_ctr, component.els_pkc.random_modes_hmacdrbg, component.els_pkc.rsa_oaep, component.els_pkc.static_lib.mimxrt.internal_condition">
      <accept condition="allOf.anyOf=device_id=MIMXRT758S, component.els_pkc.doc.mimxrt, component.els_pkc.key_derivation, component.els_pkc.oscca, component.els_pkc.platform.mimxrt, component.els_pkc.random_modes_ctr, component.els_pkc.random_modes_hmacdrbg, component.els_pkc.rsa_oaep, component.els_pkc.static_lib.mimxrt.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=device_id=MIMXRT758S, component.els_pkc.doc.mimxrt, component.els_pkc.key_derivation, component.els_pkc.oscca, component.els_pkc.platform.mimxrt, component.els_pkc.random_modes_ctr, component.els_pkc.random_modes_hmacdrbg, component.els_pkc.rsa_oaep, component.els_pkc.static_lib.mimxrt.internal_condition">
      <require condition="anyOf.device_id=MIMXRT758S.internal_condition"/>
      <require Cclass="MIMXRT758S els_pkc" Cgroup="doc" Csub="doc_mimxrt"/>
      <require Cclass="MIMXRT758S els_pkc" Cgroup="els_pkc_key_derivation"/>
      <require Cclass="MIMXRT758S els_pkc" Cgroup="els_pkc_oscca"/>
      <require Cclass="MIMXRT758S els_pkc" Cgroup="els_pkc_platform" Csub="mimxrt"/>
      <require Cclass="MIMXRT758S els_pkc" Cgroup="els_pkc_random_modes_ctr"/>
      <require Cclass="MIMXRT758S els_pkc" Cgroup="els_pkc_random_modes_hmacdrbg"/>
      <require Cclass="MIMXRT758S els_pkc" Cgroup="els_pkc_rsa_oaep"/>
      <require Cclass="MIMXRT758S els_pkc" Cgroup="static_lib_mimxrt"/>
    </condition>
    <condition id="anyOf.device_id=MIMXRT758S.internal_condition">
      <accept condition="device_id.MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="component.els_pkc.aead.condition_id">
      <require condition="allOf.component.els_pkc.aes, component.els_pkc.buffer, device=MIMXRT758S.internal_condition"/>
    </condition>
