vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MIMXRT758S_DFP.pdsc
    <condition id="component.els_pkc.examples_els.condition_id">
      <require condition="allOf.component.els_pkc.els, component.els_pkc.flow_protection, component.els_pkc.memory, component.els_pkc.session, device=MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="component.els_pkc.examples_flow_protection.condition_id">
      <require condition="allOf.component.els_pkc.els, component.els_pkc.flow_protection, component.els_pkc.memory, component.els_pkc.session, device=MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="component.els_pkc.examples_hash_modes.condition_id">
      <require condition="allOf.component.els_pkc.els, component.els_pkc.flow_protection, component.els_pkc.memory, component.els_pkc.session, device=MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="component.els_pkc.examples_hmac.condition_id">
      <require condition="allOf.component.els_pkc.els, component.els_pkc.flow_protection, component.els_pkc.memory, component.els_pkc.session, device=MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="component.els_pkc.examples_key.condition_id">
      <require condition="allOf.component.els_pkc.flow_protection, component.els_pkc.memory, component.els_pkc.session, device=MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="allOf.component.els_pkc.flow_protection, component.els_pkc.memory, component.els_pkc.session, device=MIMXRT758S.internal_condition">
      <require Cclass="MIMXRT758S els_pkc" Cgroup="els_pkc_flow_protection"/>
      <require Cclass="MIMXRT758S els_pkc" Cgroup="els_pkc_memory"/>
      <require Cclass="MIMXRT758S els_pkc" Cgroup="els_pkc_session"/>
      <require condition="device.MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="component.els_pkc.examples_mac_modes.condition_id">
      <require condition="allOf.component.els_pkc.els, component.els_pkc.flow_protection, component.els_pkc.mac, component.els_pkc.memory, component.els_pkc.session, device=MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="allOf.component.els_pkc.els, component.els_pkc.flow_protection, component.els_pkc.mac, component.els_pkc.memory, component.els_pkc.session, device=MIMXRT758S.internal_condition">
      <require Cclass="MIMXRT758S els_pkc" Cgroup="els_pkc_els"/>
      <require Cclass="MIMXRT758S els_pkc" Cgroup="els_pkc_flow_protection"/>
      <require Cclass="MIMXRT758S els_pkc" Cgroup="els_pkc_mac"/>
      <require Cclass="MIMXRT758S els_pkc" Cgroup="els_pkc_memory"/>
      <require Cclass="MIMXRT758S els_pkc" Cgroup="els_pkc_session"/>
      <require condition="device.MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="component.els_pkc.examples_memory.condition_id">
      <require condition="allOf.component.els_pkc.els, component.els_pkc.flow_protection, component.els_pkc.memory, component.els_pkc.session, device=MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="component.els_pkc.examples_random_modes.condition_id">
      <require condition="allOf.component.els_pkc.els, component.els_pkc.flow_protection, component.els_pkc.memory, component.els_pkc.session, device=MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="component.els_pkc.examples_rsa.condition_id">
      <require condition="allOf.component.els_pkc.els, component.els_pkc.flow_protection, component.els_pkc.memory, component.els_pkc.session, device=MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="component.els_pkc.flow_protection.condition_id">
      <require condition="allOf.component.els_pkc.core, device=MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="component.els_pkc.glikey.condition_id">
      <require condition="allOf.component.els_pkc.core, component.els_pkc.flow_protection, component.els_pkc.toolchain, device=MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="allOf.component.els_pkc.core, component.els_pkc.flow_protection, component.els_pkc.toolchain, device=MIMXRT758S.internal_condition">
      <require Cclass="MIMXRT758S els_pkc" Cgroup="els_pkc_core"/>
      <require Cclass="MIMXRT758S els_pkc" Cgroup="els_pkc_flow_protection"/>
      <require Cclass="MIMXRT758S els_pkc" Cgroup="els_pkc_toolchain"/>
      <require condition="device.MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="component.els_pkc.hash.condition_id">
      <require condition="allOf.component.els_pkc.hashmodes, device=MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="allOf.component.els_pkc.hashmodes, device=MIMXRT758S.internal_condition">
      <require Cclass="MIMXRT758S els_pkc" Cgroup="els_pkc_hashmodes"/>
      <require condition="device.MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="component.els_pkc.hashmodes.condition_id">
      <require condition="allOf.component.els_pkc.buffer, device=MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="component.els_pkc.hmac.condition_id">
      <require condition="allOf.component.els_pkc.key, component.els_pkc.padding, component.els_pkc.toolchain, device=MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="allOf.component.els_pkc.key, component.els_pkc.padding, component.els_pkc.toolchain, device=MIMXRT758S.internal_condition">
      <require Cclass="MIMXRT758S els_pkc" Cgroup="els_pkc_key"/>
      <require Cclass="MIMXRT758S els_pkc" Cgroup="els_pkc_padding"/>
      <require Cclass="MIMXRT758S els_pkc" Cgroup="els_pkc_toolchain"/>
      <require condition="device.MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="component.els_pkc.key.condition_id">
      <require condition="allOf.component.els_pkc.buffer, component.els_pkc.ecc, component.els_pkc.flow_protection, component.els_pkc.memory, component.els_pkc.pre_processor, component.els_pkc.secure_counter, device=MIMXRT758S.internal_condition"/>
    </condition>
