vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MIMXRT758S_DFP.pdsc
    <condition id="allOf.component.els_pkc.buffer, component.els_pkc.ecc, component.els_pkc.flow_protection, component.els_pkc.memory, component.els_pkc.pre_processor, component.els_pkc.secure_counter, device=MIMXRT758S.internal_condition">
      <require Cclass="MIMXRT758S els_pkc" Cgroup="els_pkc_buffer"/>
      <require Cclass="MIMXRT758S els_pkc" Cgroup="els_pkc_ecc"/>
      <require Cclass="MIMXRT758S els_pkc" Cgroup="els_pkc_flow_protection"/>
      <require Cclass="MIMXRT758S els_pkc" Cgroup="els_pkc_memory"/>
      <require Cclass="MIMXRT758S els_pkc" Cgroup="els_pkc_pre_processor"/>
      <require Cclass="MIMXRT758S els_pkc" Cgroup="els_pkc_secure_counter"/>
      <require condition="device.MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="component.els_pkc.key_derivation.condition_id">
      <require condition="allOf.device=MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="component.els_pkc.mac.condition_id">
      <require condition="allOf.component.els_pkc.hmac, component.els_pkc.padding, component.els_pkc.toolchain, device=MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="allOf.component.els_pkc.hmac, component.els_pkc.padding, component.els_pkc.toolchain, device=MIMXRT758S.internal_condition">
      <require Cclass="MIMXRT758S els_pkc" Cgroup="els_pkc_hmac"/>
      <require Cclass="MIMXRT758S els_pkc" Cgroup="els_pkc_padding"/>
      <require Cclass="MIMXRT758S els_pkc" Cgroup="els_pkc_toolchain"/>
      <require condition="device.MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="component.els_pkc.mac_modes.condition_id">
      <require condition="allOf.component.els_pkc.mac, device=MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="allOf.component.els_pkc.mac, device=MIMXRT758S.internal_condition">
      <require Cclass="MIMXRT758S els_pkc" Cgroup="els_pkc_mac"/>
      <require condition="device.MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="component.els_pkc.math.condition_id">
      <require condition="allOf.component.els_pkc.buffer, component.els_pkc.flow_protection, component.els_pkc.pre_processor, component.els_pkc.secure_counter, device=MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="component.els_pkc.memory.condition_id">
      <require condition="allOf.component.els_pkc.flow_protection, component.els_pkc.param_integrity, component.els_pkc.pre_processor, component.els_pkc.secure_counter, component.els_pkc.toolchain, device=MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="allOf.component.els_pkc.flow_protection, component.els_pkc.param_integrity, component.els_pkc.pre_processor, component.els_pkc.secure_counter, component.els_pkc.toolchain, device=MIMXRT758S.internal_condition">
      <require Cclass="MIMXRT758S els_pkc" Cgroup="els_pkc_flow_protection"/>
      <require Cclass="MIMXRT758S els_pkc" Cgroup="els_pkc_param_integrity"/>
      <require Cclass="MIMXRT758S els_pkc" Cgroup="els_pkc_pre_processor"/>
      <require Cclass="MIMXRT758S els_pkc" Cgroup="els_pkc_secure_counter"/>
      <require Cclass="MIMXRT758S els_pkc" Cgroup="els_pkc_toolchain"/>
      <require condition="device.MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="component.els_pkc.oscca.condition_id">
      <require condition="allOf.component.els_pkc.crc, component.els_pkc.oscca_aeadmodes, component.els_pkc.oscca_ciphermodes, component.els_pkc.oscca_macmodes, component.els_pkc.oscca_pkc, component.els_pkc.oscca_randommodes, component.els_pkc.oscca_safo, component.els_pkc.oscca_sm2, component.els_pkc.oscca_sm3, component.els_pkc.oscca_sm4, component.els_pkc.signature, device=MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="allOf.component.els_pkc.crc, component.els_pkc.oscca_aeadmodes, component.els_pkc.oscca_ciphermodes, component.els_pkc.oscca_macmodes, component.els_pkc.oscca_pkc, component.els_pkc.oscca_randommodes, component.els_pkc.oscca_safo, component.els_pkc.oscca_sm2, component.els_pkc.oscca_sm3, component.els_pkc.oscca_sm4, component.els_pkc.signature, device=MIMXRT758S.internal_condition">
      <require Cclass="MIMXRT758S els_pkc" Cgroup="els_pkc_crc"/>
      <require Cclass="MIMXRT758S els_pkc" Cgroup="els_pkc_oscca_aeadmodes"/>
      <require Cclass="MIMXRT758S els_pkc" Cgroup="els_pkc_oscca_ciphermodes"/>
      <require Cclass="MIMXRT758S els_pkc" Cgroup="els_pkc_oscca_macmodes"/>
      <require Cclass="MIMXRT758S els_pkc" Cgroup="els_pkc_oscca_pkc"/>
      <require Cclass="MIMXRT758S els_pkc" Cgroup="els_pkc_oscca_randommodes"/>
      <require Cclass="MIMXRT758S els_pkc" Cgroup="els_pkc_oscca_safo"/>
      <require Cclass="MIMXRT758S els_pkc" Cgroup="els_pkc_oscca_sm2"/>
      <require Cclass="MIMXRT758S els_pkc" Cgroup="els_pkc_oscca_sm3"/>
      <require Cclass="MIMXRT758S els_pkc" Cgroup="els_pkc_oscca_sm4"/>
      <require Cclass="MIMXRT758S els_pkc" Cgroup="els_pkc_signature"/>
      <require condition="device.MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="component.els_pkc.oscca_aeadmodes.condition_id">
      <require condition="allOf.component.els_pkc.common, device=MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="allOf.component.els_pkc.common, device=MIMXRT758S.internal_condition">
      <require Cclass="MIMXRT758S els_pkc" Cgroup="els_pkc_common"/>
      <require condition="device.MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="component.els_pkc.oscca_ciphermodes.condition_id">
      <require condition="allOf.component.els_pkc.common, device=MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="component.els_pkc.oscca_macmodes.condition_id">
      <require condition="allOf.component.els_pkc.common, device=MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="component.els_pkc.oscca_pkc.condition_id">
      <require condition="allOf.component.els_pkc.common, device=MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="component.els_pkc.oscca_randommodes.condition_id">
      <require condition="allOf.component.els_pkc.common, device=MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="component.els_pkc.oscca_safo.condition_id">
      <require condition="allOf.component.els_pkc.common, device=MIMXRT758S.internal_condition"/>
    </condition>
