vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MIMXRT758S_DFP.pdsc
    <condition id="component.els_pkc.oscca_sm2.condition_id">
      <require condition="allOf.component.els_pkc.common, component.els_pkc.signature, device=MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="allOf.component.els_pkc.common, component.els_pkc.signature, device=MIMXRT758S.internal_condition">
      <require Cclass="MIMXRT758S els_pkc" Cgroup="els_pkc_common"/>
      <require Cclass="MIMXRT758S els_pkc" Cgroup="els_pkc_signature"/>
      <require condition="device.MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="component.els_pkc.oscca_sm3.condition_id">
      <require condition="allOf.component.els_pkc.common, device=MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="component.els_pkc.oscca_sm4.condition_id">
      <require condition="allOf.component.els_pkc.common, device=MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="component.els_pkc.padding.condition_id">
      <require condition="allOf.component.els_pkc.buffer, device=MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="component.els_pkc.param_integrity.condition_id">
      <require condition="allOf.component.els_pkc.flow_protection, component.els_pkc.pre_processor, component.els_pkc.secure_counter, device=MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="allOf.component.els_pkc.flow_protection, component.els_pkc.pre_processor, component.els_pkc.secure_counter, device=MIMXRT758S.internal_condition">
      <require Cclass="MIMXRT758S els_pkc" Cgroup="els_pkc_flow_protection"/>
      <require Cclass="MIMXRT758S els_pkc" Cgroup="els_pkc_pre_processor"/>
      <require Cclass="MIMXRT758S els_pkc" Cgroup="els_pkc_secure_counter"/>
      <require condition="device.MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="component.els_pkc.pkc.condition_id">
      <require condition="allOf.component.els_pkc.ecc, component.els_pkc.math, component.els_pkc.rsa, device=MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="allOf.component.els_pkc.ecc, component.els_pkc.math, component.els_pkc.rsa, device=MIMXRT758S.internal_condition">
      <require Cclass="MIMXRT758S els_pkc" Cgroup="els_pkc_ecc"/>
      <require Cclass="MIMXRT758S els_pkc" Cgroup="els_pkc_math"/>
      <require Cclass="MIMXRT758S els_pkc" Cgroup="els_pkc_rsa"/>
      <require condition="device.MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="component.els_pkc.platform.mimxrt.condition_id">
      <require condition="allOf.anyOf=device_id=MIMXRT758S, component.els_pkc.glikey, component.els_pkc.trng.type_els.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=device_id=MIMXRT758S, component.els_pkc.glikey, component.els_pkc.trng.type_els.internal_condition">
      <require condition="anyOf.device_id=MIMXRT758S.internal_condition"/>
      <require Cclass="MIMXRT758S els_pkc" Cgroup="els_pkc_glikey"/>
      <require Cclass="MIMXRT758S els_pkc" Cgroup="els_pkc_trng_type_els"/>
    </condition>
    <condition id="component.els_pkc.pre_processor.condition_id">
      <require condition="allOf.device=MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="component.els_pkc.prng.condition_id">
      <require condition="allOf.component.els_pkc.ecc, component.els_pkc.math, component.els_pkc.rsa, device=MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="component.els_pkc.psa_driver.condition_id">
      <require condition="allOf.component.els_pkc, component.els_pkc.buffer, device=MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="allOf.component.els_pkc, component.els_pkc.buffer, device=MIMXRT758S.internal_condition">
      <require Cclass="MIMXRT758S els_pkc" Cgroup="els_pkc_main"/>
      <require Cclass="MIMXRT758S els_pkc" Cgroup="els_pkc_buffer"/>
      <require condition="device.MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="component.els_pkc.random.condition_id">
      <require condition="allOf.component.els_pkc.flow_protection, component.els_pkc.memory, component.els_pkc.pre_processor, component.els_pkc.prng, component.els_pkc.random_modes, component.els_pkc.secure_counter, device=MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="allOf.component.els_pkc.flow_protection, component.els_pkc.memory, component.els_pkc.pre_processor, component.els_pkc.prng, component.els_pkc.random_modes, component.els_pkc.secure_counter, device=MIMXRT758S.internal_condition">
      <require Cclass="MIMXRT758S els_pkc" Cgroup="els_pkc_flow_protection"/>
      <require Cclass="MIMXRT758S els_pkc" Cgroup="els_pkc_memory"/>
      <require Cclass="MIMXRT758S els_pkc" Cgroup="els_pkc_pre_processor"/>
      <require Cclass="MIMXRT758S els_pkc" Cgroup="els_pkc_prng"/>
      <require Cclass="MIMXRT758S els_pkc" Cgroup="els_pkc_random_modes"/>
      <require Cclass="MIMXRT758S els_pkc" Cgroup="els_pkc_secure_counter"/>
      <require condition="device.MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="component.els_pkc.random_modes.condition_id">
      <require condition="allOf.component.els_pkc.aes, component.els_pkc.buffer, component.els_pkc.flow_protection, component.els_pkc.memory, component.els_pkc.pre_processor, component.els_pkc.secure_counter, component.els_pkc.trng, device=MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="allOf.component.els_pkc.aes, component.els_pkc.buffer, component.els_pkc.flow_protection, component.els_pkc.memory, component.els_pkc.pre_processor, component.els_pkc.secure_counter, component.els_pkc.trng, device=MIMXRT758S.internal_condition">
      <require Cclass="MIMXRT758S els_pkc" Cgroup="els_pkc_aes"/>
      <require Cclass="MIMXRT758S els_pkc" Cgroup="els_pkc_buffer"/>
      <require Cclass="MIMXRT758S els_pkc" Cgroup="els_pkc_flow_protection"/>
      <require Cclass="MIMXRT758S els_pkc" Cgroup="els_pkc_memory"/>
      <require Cclass="MIMXRT758S els_pkc" Cgroup="els_pkc_pre_processor"/>
      <require Cclass="MIMXRT758S els_pkc" Cgroup="els_pkc_secure_counter"/>
      <require Cclass="MIMXRT758S els_pkc" Cgroup="els_pkc_trng"/>
      <require condition="device.MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="component.els_pkc.random_modes_ctr.condition_id">
      <require condition="allOf.component.els_pkc.aes, component.els_pkc.flow_protection, component.els_pkc.memory, component.els_pkc.pre_processor, component.els_pkc.secure_counter, component.els_pkc.trng, device=MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="allOf.component.els_pkc.aes, component.els_pkc.flow_protection, component.els_pkc.memory, component.els_pkc.pre_processor, component.els_pkc.secure_counter, component.els_pkc.trng, device=MIMXRT758S.internal_condition">
      <require Cclass="MIMXRT758S els_pkc" Cgroup="els_pkc_aes"/>
      <require Cclass="MIMXRT758S els_pkc" Cgroup="els_pkc_flow_protection"/>
      <require Cclass="MIMXRT758S els_pkc" Cgroup="els_pkc_memory"/>
      <require Cclass="MIMXRT758S els_pkc" Cgroup="els_pkc_pre_processor"/>
      <require Cclass="MIMXRT758S els_pkc" Cgroup="els_pkc_secure_counter"/>
      <require Cclass="MIMXRT758S els_pkc" Cgroup="els_pkc_trng"/>
      <require condition="device.MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="component.els_pkc.random_modes_hmacdrbg.condition_id">
      <require condition="allOf.component.els_pkc.random_modes, device=MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="allOf.component.els_pkc.random_modes, device=MIMXRT758S.internal_condition">
      <require Cclass="MIMXRT758S els_pkc" Cgroup="els_pkc_random_modes"/>
      <require condition="device.MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="component.els_pkc.rsa.condition_id">
      <require condition="allOf.component.els_pkc.buffer, component.els_pkc.flow_protection, component.els_pkc.memory, component.els_pkc.pre_processor, component.els_pkc.secure_counter, component.els_pkc.toolchain, device=MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="allOf.component.els_pkc.buffer, component.els_pkc.flow_protection, component.els_pkc.memory, component.els_pkc.pre_processor, component.els_pkc.secure_counter, component.els_pkc.toolchain, device=MIMXRT758S.internal_condition">
      <require Cclass="MIMXRT758S els_pkc" Cgroup="els_pkc_buffer"/>
      <require Cclass="MIMXRT758S els_pkc" Cgroup="els_pkc_flow_protection"/>
      <require Cclass="MIMXRT758S els_pkc" Cgroup="els_pkc_memory"/>
      <require Cclass="MIMXRT758S els_pkc" Cgroup="els_pkc_pre_processor"/>
      <require Cclass="MIMXRT758S els_pkc" Cgroup="els_pkc_secure_counter"/>
      <require Cclass="MIMXRT758S els_pkc" Cgroup="els_pkc_toolchain"/>
      <require condition="device.MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="component.els_pkc.rsa_oaep.condition_id">
      <require condition="allOf.component.els_pkc.rsa, device=MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="allOf.component.els_pkc.rsa, device=MIMXRT758S.internal_condition">
      <require Cclass="MIMXRT758S els_pkc" Cgroup="els_pkc_rsa"/>
      <require condition="device.MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="component.els_pkc.secure_counter.condition_id">
      <require condition="allOf.device=MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="component.els_pkc.session.condition_id">
      <require condition="allOf.component.els_pkc.flow_protection, component.els_pkc.memory, component.els_pkc.pre_processor, component.els_pkc.random, component.els_pkc.secure_counter, component.els_pkc.toolchain, device=MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="allOf.component.els_pkc.flow_protection, component.els_pkc.memory, component.els_pkc.pre_processor, component.els_pkc.random, component.els_pkc.secure_counter, component.els_pkc.toolchain, device=MIMXRT758S.internal_condition">
      <require Cclass="MIMXRT758S els_pkc" Cgroup="els_pkc_flow_protection"/>
      <require Cclass="MIMXRT758S els_pkc" Cgroup="els_pkc_memory"/>
      <require Cclass="MIMXRT758S els_pkc" Cgroup="els_pkc_pre_processor"/>
      <require Cclass="MIMXRT758S els_pkc" Cgroup="els_pkc_random"/>
      <require Cclass="MIMXRT758S els_pkc" Cgroup="els_pkc_secure_counter"/>
      <require Cclass="MIMXRT758S els_pkc" Cgroup="els_pkc_toolchain"/>
      <require condition="device.MIMXRT758S.internal_condition"/>
    </condition>
