vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MIMXRT758S_DFP.pdsc
    <condition id="component.pcm512x_adapter.condition_id">
      <require condition="allOf.device=MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="component.power_manager_framework.condition_id">
      <require condition="allOf.anyOf=driver.common, driver.crc, component.lists, device=MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=driver.common, driver.crc, component.lists, device=MIMXRT758S.internal_condition">
      <require condition="anyOf.driver.common, driver.crc.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lists"/>
      <require condition="device.MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="anyOf.driver.common, driver.crc.internal_condition">
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="crc"/>
    </condition>
    <condition id="component.reset_adapter.condition_id">
      <require condition="allOf.device=MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="component.rng_adapter_interface.condition_id">
      <require condition="allOf.anyOf=allOf=component.trng_adapter, driver.trng, component.software_rng_adapter, device=MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=allOf=component.trng_adapter, driver.trng, component.software_rng_adapter, device=MIMXRT758S.internal_condition">
      <require condition="anyOf.allOf=component.trng_adapter, driver.trng, component.software_rng_adapter.internal_condition"/>
      <require condition="device.MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="anyOf.allOf=component.trng_adapter, driver.trng, component.software_rng_adapter.internal_condition">
      <accept condition="allOf.component.trng_adapter, driver.trng.internal_condition"/>
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="software_rng_adapter"/>
    </condition>
    <condition id="allOf.component.trng_adapter, driver.trng.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="trng_adapter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="trng"/>
    </condition>
    <condition id="component.rnga_adapter.condition_id">
      <require condition="allOf.device=MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="component.serial_manager.condition_id">
      <require condition="allOf.anyOf=component.serial_manager_swo, component.serial_manager_uart, component.serial_manager_virtual, component.lists, driver.common, device=MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=component.serial_manager_swo, component.serial_manager_uart, component.serial_manager_virtual, component.lists, driver.common, device=MIMXRT758S.internal_condition">
      <require condition="anyOf.component.serial_manager_swo, component.serial_manager_uart, component.serial_manager_virtual.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lists"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require condition="device.MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="anyOf.component.serial_manager_swo, component.serial_manager_uart, component.serial_manager_virtual.internal_condition">
      <accept Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager_swo"/>
      <accept Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager_uart"/>
      <accept Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager_virtual"/>
    </condition>
    <condition id="component.serial_manager_swo.condition_id">
      <require condition="allOf.device=MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="component.serial_manager_uart.condition_id">
      <require condition="allOf.anyOf=driver.lpflexcomm_lpuart, component.lpuart_adapter, device=MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=driver.lpflexcomm_lpuart, component.lpuart_adapter, device=MIMXRT758S.internal_condition">
      <require condition="anyOf.driver.lpflexcomm_lpuart.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpuart_adapter"/>
      <require condition="device.MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="component.serial_manager_virtual.condition_id">
      <require condition="allOf.device=MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="component.sgtl_adapter.condition_id">
      <require condition="allOf.device=MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="component.software_rng_adapter.condition_id">
      <require condition="allOf.component.rng_adapter_interface, device=MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="allOf.component.rng_adapter_interface, device=MIMXRT758S.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="rng_adapter_interface"/>
      <require condition="device.MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="component.tfa9896_adapter.condition_id">
      <require condition="allOf.device=MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="component.tfa9xxx_adapter.condition_id">
      <require condition="allOf.device=MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="component.timer_manager.condition_id">
      <require condition="allOf.anyOf=allOf=component.ctimer_adapter, driver.ctimer, allOf=component.mrt_adapter, driver.mrt, allOf=component.ostimer_adapter, driver.ostimer, component.lists, driver.common, device=MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=allOf=component.ctimer_adapter, driver.ctimer, allOf=component.mrt_adapter, driver.mrt, allOf=component.ostimer_adapter, driver.ostimer, component.lists, driver.common, device=MIMXRT758S.internal_condition">
      <require condition="anyOf.allOf=component.ctimer_adapter, driver.ctimer, allOf=component.mrt_adapter, driver.mrt, allOf=component.ostimer_adapter, driver.ostimer.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lists"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require condition="device.MIMXRT758S.internal_condition"/>
    </condition>
