vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MIMXRT758S_DFP.pdsc
    <condition id="anyOf.allOf=component.ctimer_adapter, driver.ctimer, allOf=component.mrt_adapter, driver.mrt, allOf=component.ostimer_adapter, driver.ostimer.internal_condition">
      <accept condition="allOf.component.ctimer_adapter, driver.ctimer.internal_condition"/>
      <accept condition="allOf.component.mrt_adapter, driver.mrt.internal_condition"/>
      <accept condition="allOf.component.ostimer_adapter, driver.ostimer.internal_condition"/>
    </condition>
    <condition id="allOf.component.ctimer_adapter, driver.ctimer.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="ctimer_adapter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="ctimer"/>
    </condition>
    <condition id="allOf.component.mrt_adapter, driver.mrt.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="mrt_adapter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="mrt"/>
    </condition>
    <condition id="allOf.component.ostimer_adapter, driver.ostimer.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="ostimer_adapter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="ostimer"/>
    </condition>
    <condition id="component.trng_adapter.condition_id">
      <require condition="allOf.component.rng_adapter_interface, driver.trng, device=MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="allOf.component.rng_adapter_interface, driver.trng, device=MIMXRT758S.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="rng_adapter_interface"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="trng"/>
      <require condition="device.MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="component.wm8524_adapter.condition_id">
      <require condition="allOf.device=MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="component.wm8904_adapter.condition_id">
      <require condition="allOf.device=MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="component.wm8960_adapter.condition_id">
      <require condition="allOf.device=MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="component.wm8962_adapter.condition_id">
      <require condition="allOf.device=MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="device.CMSIS.condition_id">
      <require condition="allOf.CMSIS_Include_core_cm, device=MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="allOf.CMSIS_Include_core_cm, device=MIMXRT758S.internal_condition">
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require condition="device.MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="allOf.core_ids=cm33_core0.condition_id">
      <require condition="core_ids.cm33_core0.internal_condition"/>
    </condition>
    <condition id="core_ids.cm33_core0.internal_condition">
      <accept Pname="cm33_core0" Dname="*"/>
    </condition>
    <condition id="allOf.core_ids=cm33_core1.condition_id">
      <require condition="core_ids.cm33_core1.internal_condition"/>
    </condition>
    <condition id="core_ids.cm33_core1.internal_condition">
      <accept Pname="cm33_core1" Dname="*"/>
    </condition>
    <condition id="device.RTE.condition_id">
      <require condition="allOf.device=MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="device.linker.condition_id">
      <require condition="allOf.device_id=MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="allOf.device_id=MIMXRT758S.internal_condition">
      <require condition="device_id.MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="device_ids.MIMXRT758S.internal_condition">
      <accept Dname="MIMXRT758SGAWAR" Dvendor="NXP:11"/>
      <accept Dname="MIMXRT758SGAWBR" Dvendor="NXP:11"/>
      <accept Dname="MIMXRT758SGFOA" Dvendor="NXP:11"/>
      <accept Dname="MIMXRT758SGFOB" Dvendor="NXP:11"/>
    </condition>
    <condition id="allOf.toolchains=mdk, cores=cm33, core_ids=cm33_core0, device_ids=MIMXRT758S.condition_id">
      <require condition="toolchains.mdk.internal_condition"/>
      <require condition="cores.cm33.internal_condition"/>
      <require condition="core_ids.cm33_core0.internal_condition"/>
      <require condition="device_ids.MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="toolchains.mdk.internal_condition">
      <accept Tcompiler="ARMCC"/>
    </condition>
    <condition id="cores.cm33.internal_condition">
      <accept Dcore="Cortex-M33"/>
    </condition>
    <condition id="allOf.toolchains=armgcc, cores=cm33, core_ids=cm33_core0, device_ids=MIMXRT758S.condition_id">
      <require condition="toolchains.armgcc.internal_condition"/>
      <require condition="cores.cm33.internal_condition"/>
      <require condition="core_ids.cm33_core0.internal_condition"/>
      <require condition="device_ids.MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="toolchains.armgcc.internal_condition">
      <accept Tcompiler="GCC"/>
    </condition>
    <condition id="allOf.toolchains=iar, cores=cm33, core_ids=cm33_core0, device_ids=MIMXRT758S.condition_id">
      <require condition="toolchains.iar.internal_condition"/>
      <require condition="cores.cm33.internal_condition"/>
      <require condition="core_ids.cm33_core0.internal_condition"/>
      <require condition="device_ids.MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="toolchains.iar.internal_condition">
      <accept Tcompiler="IAR"/>
    </condition>
    <condition id="allOf.toolchains=mdk, cores=cm33, core_ids=cm33_core1, device_ids=MIMXRT758S.condition_id">
      <require condition="toolchains.mdk.internal_condition"/>
      <require condition="cores.cm33.internal_condition"/>
      <require condition="core_ids.cm33_core1.internal_condition"/>
      <require condition="device_ids.MIMXRT758S.internal_condition"/>
    </condition>
