vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MIMXRT758S_DFP.pdsc
    <condition id="allOf.toolchains=armgcc, cores=cm33, core_ids=cm33_core1, device_ids=MIMXRT758S.condition_id">
      <require condition="toolchains.armgcc.internal_condition"/>
      <require condition="cores.cm33.internal_condition"/>
      <require condition="core_ids.cm33_core1.internal_condition"/>
      <require condition="device_ids.MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="allOf.toolchains=iar, cores=cm33, core_ids=cm33_core1, device_ids=MIMXRT758S.condition_id">
      <require condition="toolchains.iar.internal_condition"/>
      <require condition="cores.cm33.internal_condition"/>
      <require condition="core_ids.cm33_core1.internal_condition"/>
      <require condition="device_ids.MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="device.project_template.condition_id">
      <require condition="allOf.driver.lpflexcomm, driver.lpflexcomm_lpuart, driver.iopctl_soc, driver.gpio, driver.reset, device_id=MIMXRT758S, device.startup, driver.common, driver.clock, driver.glikey, anyOf=allOf=utility.debug_console, utility.debug_console_template_config, utility.assert, component.serial_manager, component.serial_manager_uart, allOf=utility.debug_console_lite, utility.assert_lite, anyOf=allOf=driver.xspi, driver.cache_xcache, driver.power, core_id=cm33_core0, allOf=driver.power, core_id=cm33_core1.internal_condition"/>
    </condition>
    <condition id="allOf.driver.lpflexcomm, driver.lpflexcomm_lpuart, driver.iopctl_soc, driver.gpio, driver.reset, device_id=MIMXRT758S, device.startup, driver.common, driver.clock, driver.glikey, anyOf=allOf=utility.debug_console, utility.debug_console_template_config, utility.assert, component.serial_manager, component.serial_manager_uart, allOf=utility.debug_console_lite, utility.assert_lite, anyOf=allOf=driver.xspi, driver.cache_xcache, driver.power, core_id=cm33_core0, allOf=driver.power, core_id=cm33_core1.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpflexcomm"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpuart"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="iopctl"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="gpio"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="reset"/>
      <require condition="device_id.MIMXRT758S.internal_condition"/>
      <require Cclass="Device" Cgroup="Startup" Csub=""/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="clock"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="glikey"/>
      <require condition="anyOf.allOf=utility.debug_console, utility.debug_console_template_config, utility.assert, component.serial_manager, component.serial_manager_uart, allOf=utility.debug_console_lite, utility.assert_lite.internal_condition"/>
      <require condition="anyOf.allOf=driver.xspi, driver.cache_xcache, driver.power, core_id=cm33_core0, allOf=driver.power, core_id=cm33_core1.internal_condition"/>
    </condition>
    <condition id="anyOf.allOf=utility.debug_console, utility.debug_console_template_config, utility.assert, component.serial_manager, component.serial_manager_uart, allOf=utility.debug_console_lite, utility.assert_lite.internal_condition">
      <accept condition="allOf.utility.debug_console, utility.debug_console_template_config, utility.assert, component.serial_manager, component.serial_manager_uart.internal_condition"/>
      <accept condition="allOf.utility.debug_console_lite, utility.assert_lite.internal_condition"/>
    </condition>
    <condition id="allOf.utility.debug_console, utility.debug_console_template_config, utility.assert, component.serial_manager, component.serial_manager_uart.internal_condition">
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="debug_console"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="debug console template config"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="assert"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager_uart"/>
    </condition>
    <condition id="allOf.utility.debug_console_lite, utility.assert_lite.internal_condition">
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="debug_console_lite"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="assert_lite"/>
    </condition>
    <condition id="anyOf.allOf=driver.xspi, driver.cache_xcache, driver.power, core_id=cm33_core0, allOf=driver.power, core_id=cm33_core1.internal_condition">
      <accept condition="allOf.driver.xspi, driver.cache_xcache, driver.power, core_id=cm33_core0.internal_condition"/>
      <accept condition="allOf.driver.power, core_id=cm33_core1.internal_condition"/>
    </condition>
    <condition id="allOf.driver.xspi, driver.cache_xcache, driver.power, core_id=cm33_core0.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="xspi"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="cache_xcache"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="power"/>
      <require condition="core_id.cm33_core0.internal_condition"/>
    </condition>
    <condition id="core_id.cm33_core0.internal_condition">
      <accept Pname="cm33_core0" Dname="*"/>
    </condition>
    <condition id="allOf.driver.power, core_id=cm33_core1.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="power"/>
      <require condition="core_id.cm33_core1.internal_condition"/>
    </condition>
    <condition id="core_id.cm33_core1.internal_condition">
      <accept Pname="cm33_core1" Dname="*"/>
    </condition>
    <condition id="device.startup.condition_id">
      <require condition="allOf.device.system, device=MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="allOf.device.system, device=MIMXRT758S.internal_condition">
      <require Cclass="Device" Cgroup="CMSIS" Csub="MIMXRT758S_system"/>
      <require condition="device.MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="allOf.toolchains=armgcc, iar, mdk, core_ids=cm33_core0.condition_id">
      <require condition="toolchains.armgcc, iar, mdk.internal_condition"/>
      <require condition="core_ids.cm33_core0.internal_condition"/>
    </condition>
    <condition id="toolchains.armgcc, iar, mdk.internal_condition">
      <accept Tcompiler="GCC"/>
      <accept Tcompiler="IAR"/>
      <accept Tcompiler="ARMCC"/>
    </condition>
