vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MIMXRT758S_DFP.pdsc
    <condition id="allOf.toolchains=armgcc, iar, mdk, core_ids=cm33_core1.condition_id">
      <require condition="toolchains.armgcc, iar, mdk.internal_condition"/>
      <require condition="core_ids.cm33_core1.internal_condition"/>
    </condition>
    <condition id="device.system.condition_id">
      <require condition="allOf.device.CMSIS, device=MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="allOf.device.CMSIS, device=MIMXRT758S.internal_condition">
      <require Cclass="Device" Cgroup="CMSIS" Csub="MIMXRT758S_header"/>
      <require condition="device.MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="driver.acmp.condition_id">
      <require condition="allOf.driver.common, device_id=MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, device_id=MIMXRT758S.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require condition="device_id.MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="driver.ak4497.condition_id">
      <require condition="allOf.component.ak4497_adapter, component.codec_adapters, component.codec_i2c, driver.codec, device=MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="allOf.component.ak4497_adapter, component.codec_adapters, component.codec_i2c, driver.codec, device=MIMXRT758S.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="ak4497_adapter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_adapters"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_i2c"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec"/>
      <require condition="device.MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="driver.cache_xcache.condition_id">
      <require condition="allOf.driver.common, device_id=MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="driver.cdog.condition_id">
      <require condition="allOf.driver.common, device_id=MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="driver.clock.condition_id">
      <require condition="allOf.device=MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="driver.cmsis_lpi2c.condition_id">
      <require condition="allOf.CMSIS_Driver_Include.I2C, anyOf=allOf=driver.lpflexcomm_lpi2c, device_id=MIMXRT758S, device.RTE, device_id=MIMXRT758S, driver.lpflexcomm_lpi2c_edma.internal_condition"/>
    </condition>
    <condition id="allOf.CMSIS_Driver_Include.I2C, anyOf=allOf=driver.lpflexcomm_lpi2c, device_id=MIMXRT758S, device.RTE, device_id=MIMXRT758S, driver.lpflexcomm_lpi2c_edma.internal_condition">
      <require Cclass="CMSIS Driver" Cgroup="I2C" Capiversion="2.4.0"/>
      <require condition="anyOf.allOf=driver.lpflexcomm_lpi2c, device_id=MIMXRT758S.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device"/>
      <require condition="device_id.MIMXRT758S.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpi2c_edma"/>
    </condition>
    <condition id="anyOf.allOf=driver.lpflexcomm_lpi2c, device_id=MIMXRT758S.internal_condition">
      <accept condition="allOf.driver.lpflexcomm_lpi2c, device_id=MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="allOf.driver.lpflexcomm_lpi2c, device_id=MIMXRT758S.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpi2c"/>
      <require condition="device_id.MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="driver.cmsis_lpspi.condition_id">
      <require condition="allOf.CMSIS_Driver_Include.SPI, anyOf=allOf=driver.lpflexcomm_lpspi, device_id=MIMXRT758S, device.RTE, device_id=MIMXRT758S, driver.lpflexcomm_lpspi_edma.internal_condition"/>
    </condition>
    <condition id="allOf.CMSIS_Driver_Include.SPI, anyOf=allOf=driver.lpflexcomm_lpspi, device_id=MIMXRT758S, device.RTE, device_id=MIMXRT758S, driver.lpflexcomm_lpspi_edma.internal_condition">
      <require Cclass="CMSIS Driver" Cgroup="SPI" Capiversion="2.3.0"/>
      <require condition="anyOf.allOf=driver.lpflexcomm_lpspi, device_id=MIMXRT758S.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device"/>
      <require condition="device_id.MIMXRT758S.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpspi_edma"/>
    </condition>
    <condition id="anyOf.allOf=driver.lpflexcomm_lpspi, device_id=MIMXRT758S.internal_condition">
      <accept condition="allOf.driver.lpflexcomm_lpspi, device_id=MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="allOf.driver.lpflexcomm_lpspi, device_id=MIMXRT758S.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpspi"/>
      <require condition="device_id.MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="driver.cmsis_lpuart.condition_id">
      <require condition="allOf.CMSIS_Driver_Include.USART, anyOf=allOf=driver.lpflexcomm_lpuart, device_id=MIMXRT758S, device.RTE, device_id=MIMXRT758S, driver.lpflexcomm_lpuart_edma.internal_condition"/>
    </condition>
    <condition id="allOf.CMSIS_Driver_Include.USART, anyOf=allOf=driver.lpflexcomm_lpuart, device_id=MIMXRT758S, device.RTE, device_id=MIMXRT758S, driver.lpflexcomm_lpuart_edma.internal_condition">
      <require Cclass="CMSIS Driver" Cgroup="USART" Capiversion="2.4.0"/>
      <require condition="anyOf.allOf=driver.lpflexcomm_lpuart, device_id=MIMXRT758S.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device"/>
      <require condition="device_id.MIMXRT758S.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpuart_edma"/>
    </condition>
    <condition id="anyOf.allOf=driver.lpflexcomm_lpuart, device_id=MIMXRT758S.internal_condition">
      <accept condition="allOf.driver.lpflexcomm_lpuart, device_id=MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="allOf.driver.lpflexcomm_lpuart, device_id=MIMXRT758S.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpuart"/>
      <require condition="device_id.MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="driver.codec.condition_id">
      <require condition="allOf.device=MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="driver.common.condition_id">
      <require condition="allOf.device=MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="allOf.cores=cm33.condition_id">
      <require condition="cores.cm33.internal_condition"/>
    </condition>
    <condition id="driver.crc.condition_id">
      <require condition="allOf.driver.common, device_id=MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="driver.cs42448.condition_id">
      <require condition="allOf.component.codec_adapters, component.codec_i2c, component.cs42448_adapter, driver.codec, device=MIMXRT758S.internal_condition"/>
    </condition>
