vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MIMXRT758S_DFP.pdsc
    <condition id="allOf.component.codec_adapters, component.codec_i2c, component.cs42448_adapter, driver.codec, device=MIMXRT758S.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_adapters"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_i2c"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="cs42448_adapter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec"/>
      <require condition="device.MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="driver.cs42888.condition_id">
      <require condition="allOf.component.codec_adapters, component.codec_i2c, component.cs42888_adapter, driver.codec, device=MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="allOf.component.codec_adapters, component.codec_i2c, component.cs42888_adapter, driver.codec, device=MIMXRT758S.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_adapters"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_i2c"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="cs42888_adapter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec"/>
      <require condition="device.MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="driver.ctimer.condition_id">
      <require condition="allOf.driver.common, device_id=MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="driver.dialog7212.condition_id">
      <require condition="allOf.component.codec_adapters, component.codec_i2c, component.da7212_adapter, driver.codec, device=MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="allOf.component.codec_adapters, component.codec_i2c, component.da7212_adapter, driver.codec, device=MIMXRT758S.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_adapters"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_i2c"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="da7212_adapter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec"/>
      <require condition="device.MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="driver.dsp.condition_id">
      <require condition="allOf.driver.power, core_id=cm33_core1, device=MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="allOf.driver.power, core_id=cm33_core1, device=MIMXRT758S.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="power"/>
      <require condition="core_id.cm33_core1.internal_condition"/>
      <require condition="device.MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="driver.edma4.condition_id">
      <require condition="allOf.driver.edma_soc, device_id=MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="allOf.driver.edma_soc, device_id=MIMXRT758S.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="edma_soc"/>
      <require condition="device_id.MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="driver.edma_soc.condition_id">
      <require condition="allOf.device=MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="driver.ezhv.condition_id">
      <require condition="allOf.core_id=cm33_core0, device_id=MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="allOf.core_id=cm33_core0, device_id=MIMXRT758S.internal_condition">
      <require condition="core_id.cm33_core0.internal_condition"/>
      <require condition="device_id.MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="driver.flexio.condition_id">
      <require condition="allOf.driver.common, device_id=MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="driver.flexio_i2c_master.condition_id">
      <require condition="allOf.driver.flexio, device_id=MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="allOf.driver.flexio, device_id=MIMXRT758S.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="flexio"/>
      <require condition="device_id.MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="driver.flexio_i2s.condition_id">
      <require condition="allOf.driver.flexio, device_id=MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="driver.flexio_i2s_edma.condition_id">
      <require condition="allOf.anyOf=driver.edma4, driver.flexio_i2s, device=MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=driver.edma4, driver.flexio_i2s, device=MIMXRT758S.internal_condition">
      <require condition="anyOf.driver.edma4.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="flexio_i2s"/>
      <require condition="device.MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="anyOf.driver.edma4.internal_condition">
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="edma"/>
    </condition>
    <condition id="driver.flexio_mculcd.condition_id">
      <require condition="allOf.driver.flexio, device_id=MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="driver.flexio_mculcd_edma.condition_id">
      <require condition="allOf.anyOf=driver.edma4, driver.flexio_mculcd, driver.edma4, device=MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=driver.edma4, driver.flexio_mculcd, driver.edma4, device=MIMXRT758S.internal_condition">
      <require condition="anyOf.driver.edma4.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="flexio_mculcd"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="edma"/>
      <require condition="device.MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="driver.flexio_spi.condition_id">
      <require condition="allOf.driver.flexio, device_id=MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="driver.flexio_spi_edma.condition_id">
      <require condition="allOf.anyOf=driver.edma4, driver.flexio_spi, driver.edma4, device=MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=driver.edma4, driver.flexio_spi, driver.edma4, device=MIMXRT758S.internal_condition">
      <require condition="anyOf.driver.edma4.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="flexio_spi"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="edma"/>
      <require condition="device.MIMXRT758S.internal_condition"/>
    </condition>
