vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MIMXRT758S_DFP.pdsc
    <condition id="driver.lpflexcomm_lpspi.condition_id">
      <require condition="allOf.driver.lpflexcomm, device_id=MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="driver.lpflexcomm_lpspi_edma.condition_id">
      <require condition="allOf.driver.edma4, driver.lpflexcomm_lpspi, device=MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="allOf.driver.edma4, driver.lpflexcomm_lpspi, device=MIMXRT758S.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="edma"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpspi"/>
      <require condition="device.MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="driver.lpflexcomm_lpuart.condition_id">
      <require condition="allOf.driver.lpflexcomm, device_id=MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="driver.lpflexcomm_lpuart_edma.condition_id">
      <require condition="allOf.driver.edma4, driver.lpflexcomm_lpuart, device=MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="allOf.driver.edma4, driver.lpflexcomm_lpuart, device=MIMXRT758S.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="edma"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpuart"/>
      <require condition="device.MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="driver.lsm6dso.condition_id">
      <require condition="allOf.anyOf=driver.lpflexcomm_lpi2c, driver.common, device=MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="driver.max30101.condition_id">
      <require condition="allOf.anyOf=driver.lpflexcomm_lpi2c, driver.common, device=MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="driver.mipi_dsi.condition_id">
      <require condition="allOf.driver.common, driver.mipi_dsi_soc, device_id=MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, driver.mipi_dsi_soc, device_id=MIMXRT758S.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="soc_mipi_dsi"/>
      <require condition="device_id.MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="driver.mipi_dsi_soc.condition_id">
      <require condition="allOf.device=MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="driver.mma8451q.condition_id">
      <require condition="allOf.anyOf=driver.lpflexcomm_lpi2c, driver.common, device=MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="driver.mma8652fc.condition_id">
      <require condition="allOf.anyOf=driver.lpflexcomm_lpi2c, driver.common, device=MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="driver.mmu.condition_id">
      <require condition="allOf.driver.common, device_id=MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="driver.mrt.condition_id">
      <require condition="allOf.driver.common, device_id=MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="driver.mu1.condition_id">
      <require condition="allOf.driver.common, device_id=MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="driver.nmh1000.condition_id">
      <require condition="allOf.anyOf=driver.lpflexcomm_lpi2c, driver.common, device=MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="driver.ostimer.condition_id">
      <require condition="allOf.driver.common, device_id=MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="driver.p3t1755.condition_id">
      <require condition="allOf.anyOf=driver.lpflexcomm_lpi2c, driver.common, device=MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="driver.pca9420.condition_id">
      <require condition="allOf.anyOf=driver.lpflexcomm_lpi2c, driver.common, driver.power, device=MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=driver.lpflexcomm_lpi2c, driver.common, driver.power, device=MIMXRT758S.internal_condition">
      <require condition="anyOf.driver.lpflexcomm_lpi2c.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="power"/>
      <require condition="device.MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="driver.pca9422.condition_id">
      <require condition="allOf.anyOf=driver.lpflexcomm_lpi2c, driver.common, driver.power, device=MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="driver.pcm186x.condition_id">
      <require condition="allOf.component.codec_adapters, component.codec_i2c, component.pcm186x_adapter, driver.codec, device=MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="allOf.component.codec_adapters, component.codec_i2c, component.pcm186x_adapter, driver.codec, device=MIMXRT758S.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_adapters"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_i2c"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="pcm186x_adapter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec"/>
      <require condition="device.MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="driver.pcm512x.condition_id">
      <require condition="allOf.component.codec_adapters, component.codec_i2c, component.pcm512x_adapter, driver.codec, device=MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="allOf.component.codec_adapters, component.codec_i2c, component.pcm512x_adapter, driver.codec, device=MIMXRT758S.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_adapters"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_i2c"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="pcm512x_adapter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec"/>
      <require condition="device.MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="driver.pdm.condition_id">
      <require condition="allOf.driver.common, device_id=MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="driver.pdm_edma.condition_id">
      <require condition="allOf.anyOf=driver.edma4, driver.pdm, driver.edma4, device=MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=driver.edma4, driver.pdm, driver.edma4, device=MIMXRT758S.internal_condition">
      <require condition="anyOf.driver.edma4.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="pdm"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="edma"/>
      <require condition="device.MIMXRT758S.internal_condition"/>
    </condition>
