vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MIMXRT758S_DFP.pdsc
    <condition id="allOf.component.codec_adapters, component.codec_i2c, component.wm8524_adapter, driver.codec, device=MIMXRT758S.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_adapters"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_i2c"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="wm8524_adapter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec"/>
      <require condition="device.MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="driver.wm8904.condition_id">
      <require condition="allOf.component.codec_adapters, component.codec_i2c, component.wm8904_adapter, driver.codec, device=MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="allOf.component.codec_adapters, component.codec_i2c, component.wm8904_adapter, driver.codec, device=MIMXRT758S.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_adapters"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_i2c"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="wm8904_adapter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec"/>
      <require condition="device.MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="driver.wm8960.condition_id">
      <require condition="allOf.component.codec_adapters, component.codec_i2c, component.wm8960_adapter, driver.codec, device=MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="allOf.component.codec_adapters, component.codec_i2c, component.wm8960_adapter, driver.codec, device=MIMXRT758S.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_adapters"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_i2c"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="wm8960_adapter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec"/>
      <require condition="device.MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="driver.wm8962.condition_id">
      <require condition="allOf.component.codec_adapters, component.codec_i2c, component.wm8962_adapter, driver.codec, device=MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="allOf.component.codec_adapters, component.codec_i2c, component.wm8962_adapter, driver.codec, device=MIMXRT758S.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_adapters"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_i2c"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="wm8962_adapter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec"/>
      <require condition="device.MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="driver.wwdt.condition_id">
      <require condition="allOf.driver.common, device_id=MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="driver.xspi.condition_id">
      <require condition="allOf.driver.common, device_id=MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="driver.xspi_edma.condition_id">
      <require condition="allOf.anyOf=driver.edma4, driver.xspi, driver.edma4, device=MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=driver.edma4, driver.xspi, driver.edma4, device=MIMXRT758S.internal_condition">
      <require condition="anyOf.driver.edma4.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="xspi"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="edma"/>
      <require condition="device.MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="middleware.baremetal.condition_id">
      <require condition="allOf.device=MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="utilities.misc_utilities.condition_id">
      <require condition="allOf.device=MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="allOf.toolchains=armgcc.condition_id">
      <require condition="toolchains.armgcc.internal_condition"/>
    </condition>
    <condition id="allOf.toolchains=armgcc, mdk, cores=cm33.condition_id">
      <require condition="toolchains.armgcc, mdk.internal_condition"/>
      <require condition="cores.cm33.internal_condition"/>
    </condition>
    <condition id="toolchains.armgcc, mdk.internal_condition">
      <accept Tcompiler="GCC"/>
      <accept Tcompiler="ARMCC"/>
    </condition>
    <condition id="utilities.unity.condition_id">
      <require condition="allOf.device=MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="utility.assert.condition_id">
      <require condition="allOf.driver.common, utility.debug_console, device=MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, utility.debug_console, device=MIMXRT758S.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="debug_console"/>
      <require condition="device.MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="utility.assert_lite.condition_id">
      <require condition="allOf.driver.common, not=utility.assert, utility.debug_console_lite, device=MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, not=utility.assert, utility.debug_console_lite, device=MIMXRT758S.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require condition="not.utility.assert.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="debug_console_lite"/>
      <require condition="device.MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="not.utility.assert.internal_condition">
      <deny Cclass="Device" Cgroup="SDK Utilities" Csub="assert"/>
    </condition>
    <condition id="utility.debug_console.condition_id">
      <require condition="allOf.component.serial_manager, driver.common, utility.str, device=MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="allOf.component.serial_manager, driver.common, utility.str, device=MIMXRT758S.internal_condition">
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="str"/>
      <require condition="device.MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="utility.debug_console_lite.condition_id">
      <require condition="allOf.component.lpuart_adapter, device=MIMXRT758S.internal_condition"/>
    </condition>
    <condition id="allOf.component.lpuart_adapter, device=MIMXRT758S.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpuart_adapter"/>
      <require condition="device.MIMXRT758S.internal_condition"/>
    </condition>
