vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MIMXRT758S_DFP.pdsc
    <component Cclass="MIMXRT758S els_pkc" Cgroup="els_pkc_common" Cversion="1.9.0" condition="component.els_pkc.common.condition_id">
      <description>Component els pkc common</description>
      <files>
        <file category="sourceC" name="components/els_pkc/src/comps/common/src/mcuxClOscca_CommonOperations.c" projectpath="component/els_pkc/src/comps/common/src"/>
        <file category="header" name="components/els_pkc/src/comps/common/inc/mcuxClOscca_FunctionIdentifiers.h" projectpath="component/els_pkc/src/comps/common/inc"/>
        <file category="header" name="components/els_pkc/src/comps/common/inc/mcuxClOscca_Memory.h" projectpath="component/els_pkc/src/comps/common/inc"/>
        <file category="header" name="components/els_pkc/src/comps/common/inc/mcuxClOscca_PlatformTypes.h" projectpath="component/els_pkc/src/comps/common/inc"/>
        <file category="header" name="components/els_pkc/src/comps/common/inc/mcuxClOscca_Types.h" projectpath="component/els_pkc/src/comps/common/inc"/>
        <file category="include" name="components/els_pkc/"/>
        <file category="include" name="components/els_pkc/src/comps/common/inc/"/>
      </files>
    </component>
    <component Cclass="MIMXRT758S els_pkc" Cgroup="els_pkc_core" Cversion="1.9.0" condition="component.els_pkc.core.condition_id">
      <description>Component els_pkc.core</description>
      <files>
        <file category="header" name="components/els_pkc/src/comps/mcuxClCore/inc/mcuxClCore_Examples.h" projectpath="component/els_pkc/src/comps/mcuxClCore/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClCore/inc/mcuxClCore_FunctionIdentifiers.h" projectpath="component/els_pkc/src/comps/mcuxClCore/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClCore/inc/mcuxClCore_Macros.h" projectpath="component/els_pkc/src/comps/mcuxClCore/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClCore/inc/mcuxClCore_Platform.h" projectpath="component/els_pkc/src/comps/mcuxClCore/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClCore/inc/mcuxClCore_Toolchain.h" projectpath="component/els_pkc/src/comps/mcuxClCore/inc"/>
        <file category="include" name="components/els_pkc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxClCore/inc/"/>
      </files>
    </component>
    <component Cclass="MIMXRT758S els_pkc" Cgroup="els_pkc_crc" Cversion="1.9.0" condition="component.els_pkc.crc.condition_id">
      <description>Component crc</description>
      <files>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClCrc/src/mcuxClCrc.c" projectpath="component/els_pkc/src/comps/mcuxClCrc/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClCrc/src/mcuxClCrc_Sw.c" projectpath="component/els_pkc/src/comps/mcuxClCrc/src"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClCrc/inc/mcuxClCrc.h" projectpath="component/els_pkc/src/comps/mcuxClCrc/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClCrc/inc/internal/mcuxClCrc_Internal_Constants.h" projectpath="component/els_pkc/src/comps/mcuxClCrc/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClCrc/inc/internal/mcuxClCrc_Internal_Functions.h" projectpath="component/els_pkc/src/comps/mcuxClCrc/inc/internal"/>
        <file category="include" name="components/els_pkc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxClCrc/inc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxClCrc/inc/internal/"/>
      </files>
    </component>
    <component Cclass="MIMXRT758S els_pkc" Cgroup="els_pkc_data_integrity" Cversion="1.9.0" condition="component.els_pkc.data_integrity.condition_id">
      <description>Component els_pkc.data_integrity</description>
      <files>
        <file category="header" name="components/els_pkc/src/comps/mcuxCsslDataIntegrity/inc/mcuxCsslDataIntegrity.h" projectpath="component/els_pkc/src/comps/mcuxCsslDataIntegrity/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxCsslDataIntegrity/inc/mcuxCsslDataIntegrity_Cfg.h" projectpath="component/els_pkc/src/comps/mcuxCsslDataIntegrity/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxCsslDataIntegrity/inc/mcuxCsslDataIntegrity_Impl.h" projectpath="component/els_pkc/src/comps/mcuxCsslDataIntegrity/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxCsslDataIntegrity/inc/mcuxCsslDataIntegrity_None.h" projectpath="component/els_pkc/src/comps/mcuxCsslDataIntegrity/inc"/>
        <file category="include" name="components/els_pkc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxCsslDataIntegrity/inc/"/>
      </files>
    </component>
    <component Cclass="MIMXRT758S els_pkc" Cgroup="doc" Csub="doc_mimxrt" Cversion="1.9.0" condition="component.els_pkc.doc.mimxrt.condition_id">
      <description>Component els_pkc.doc.mimxrt</description>
      <files>
        <file category="doc" name="components/els_pkc/doc/mimxrt/html/a00002.html" projectpath="component/els_pkc/doc/mimxrt/html"/>
        <file category="other" name="components/els_pkc/doc/mimxrt/html/a00002.js" projectpath="component/els_pkc/doc/mimxrt/html"/>
        <file category="doc" name="components/els_pkc/doc/mimxrt/html/a00005.html" projectpath="component/els_pkc/doc/mimxrt/html"/>
        <file category="other" name="components/els_pkc/doc/mimxrt/html/a00005.js" projectpath="component/els_pkc/doc/mimxrt/html"/>
        <file category="doc" name="components/els_pkc/doc/mimxrt/html/a00008.html" projectpath="component/els_pkc/doc/mimxrt/html"/>
        <file category="other" name="components/els_pkc/doc/mimxrt/html/a00008.js" projectpath="component/els_pkc/doc/mimxrt/html"/>
        <file category="doc" name="components/els_pkc/doc/mimxrt/html/a00011.html" projectpath="component/els_pkc/doc/mimxrt/html"/>
        <file category="other" name="components/els_pkc/doc/mimxrt/html/a00011.js" projectpath="component/els_pkc/doc/mimxrt/html"/>
        <file category="doc" name="components/els_pkc/doc/mimxrt/html/a00014.html" projectpath="component/els_pkc/doc/mimxrt/html"/>
        <file category="other" name="components/els_pkc/doc/mimxrt/html/a00014.js" projectpath="component/els_pkc/doc/mimxrt/html"/>
        <file category="doc" name="components/els_pkc/doc/mimxrt/html/a00017.html" projectpath="component/els_pkc/doc/mimxrt/html"/>
        <file category="other" name="components/els_pkc/doc/mimxrt/html/a00017.js" projectpath="component/els_pkc/doc/mimxrt/html"/>
        <file category="doc" name="components/els_pkc/doc/mimxrt/html/a00020.html" projectpath="component/els_pkc/doc/mimxrt/html"/>
        <file category="other" name="components/els_pkc/doc/mimxrt/html/a00020.js" projectpath="component/els_pkc/doc/mimxrt/html"/>
        <file category="doc" name="components/els_pkc/doc/mimxrt/html/a00023.html" projectpath="component/els_pkc/doc/mimxrt/html"/>
        <file category="other" name="components/els_pkc/doc/mimxrt/html/a00023.js" projectpath="component/els_pkc/doc/mimxrt/html"/>
        <file category="doc" name="components/els_pkc/doc/mimxrt/html/a00026.html" projectpath="component/els_pkc/doc/mimxrt/html"/>
        <file category="other" name="components/els_pkc/doc/mimxrt/html/a00026.js" projectpath="component/els_pkc/doc/mimxrt/html"/>
        <file category="doc" name="components/els_pkc/doc/mimxrt/html/a00029.html" projectpath="component/els_pkc/doc/mimxrt/html"/>
        <file category="other" name="components/els_pkc/doc/mimxrt/html/a00029.js" projectpath="component/els_pkc/doc/mimxrt/html"/>
        <file category="doc" name="components/els_pkc/doc/mimxrt/html/a00032.html" projectpath="component/els_pkc/doc/mimxrt/html"/>
        <file category="other" name="components/els_pkc/doc/mimxrt/html/a00032.js" projectpath="component/els_pkc/doc/mimxrt/html"/>
        <file category="doc" name="components/els_pkc/doc/mimxrt/html/a00035.html" projectpath="component/els_pkc/doc/mimxrt/html"/>
        <file category="other" name="components/els_pkc/doc/mimxrt/html/a00035.js" projectpath="component/els_pkc/doc/mimxrt/html"/>
        <file category="doc" name="components/els_pkc/doc/mimxrt/html/a00038.html" projectpath="component/els_pkc/doc/mimxrt/html"/>
        <file category="other" name="components/els_pkc/doc/mimxrt/html/a00038.js" projectpath="component/els_pkc/doc/mimxrt/html"/>
        <file category="doc" name="components/els_pkc/doc/mimxrt/html/a00044.html" projectpath="component/els_pkc/doc/mimxrt/html"/>
        <file category="other" name="components/els_pkc/doc/mimxrt/html/a00044.js" projectpath="component/els_pkc/doc/mimxrt/html"/>
        <file category="doc" name="components/els_pkc/doc/mimxrt/html/a00047.html" projectpath="component/els_pkc/doc/mimxrt/html"/>
        <file category="other" name="components/els_pkc/doc/mimxrt/html/a00047.js" projectpath="component/els_pkc/doc/mimxrt/html"/>
        <file category="doc" name="components/els_pkc/doc/mimxrt/html/a00050.html" projectpath="component/els_pkc/doc/mimxrt/html"/>
        <file category="other" name="components/els_pkc/doc/mimxrt/html/a00050.js" projectpath="component/els_pkc/doc/mimxrt/html"/>
        <file category="doc" name="components/els_pkc/doc/mimxrt/html/a00083.html" projectpath="component/els_pkc/doc/mimxrt/html"/>
        <file category="other" name="components/els_pkc/doc/mimxrt/html/a00083.js" projectpath="component/els_pkc/doc/mimxrt/html"/>
        <file category="doc" name="components/els_pkc/doc/mimxrt/html/a00086.html" projectpath="component/els_pkc/doc/mimxrt/html"/>
        <file category="other" name="components/els_pkc/doc/mimxrt/html/a00086.js" projectpath="component/els_pkc/doc/mimxrt/html"/>
        <file category="doc" name="components/els_pkc/doc/mimxrt/html/a00089.html" projectpath="component/els_pkc/doc/mimxrt/html"/>
        <file category="doc" name="components/els_pkc/doc/mimxrt/html/a00092.html" projectpath="component/els_pkc/doc/mimxrt/html"/>
        <file category="doc" name="components/els_pkc/doc/mimxrt/html/a00095.html" projectpath="component/els_pkc/doc/mimxrt/html"/>
        <file category="doc" name="components/els_pkc/doc/mimxrt/html/a00098.html" projectpath="component/els_pkc/doc/mimxrt/html"/>
        <file category="other" name="components/els_pkc/doc/mimxrt/html/a00098.js" projectpath="component/els_pkc/doc/mimxrt/html"/>
        <file category="doc" name="components/els_pkc/doc/mimxrt/html/a00101.html" projectpath="component/els_pkc/doc/mimxrt/html"/>
        <file category="other" name="components/els_pkc/doc/mimxrt/html/a00101.js" projectpath="component/els_pkc/doc/mimxrt/html"/>
        <file category="doc" name="components/els_pkc/doc/mimxrt/html/a00104.html" projectpath="component/els_pkc/doc/mimxrt/html"/>
        <file category="doc" name="components/els_pkc/doc/mimxrt/html/a00107.html" projectpath="component/els_pkc/doc/mimxrt/html"/>
        <file category="doc" name="components/els_pkc/doc/mimxrt/html/a00110.html" projectpath="component/els_pkc/doc/mimxrt/html"/>
        <file category="doc" name="components/els_pkc/doc/mimxrt/html/a00113.html" projectpath="component/els_pkc/doc/mimxrt/html"/>
        <file category="doc" name="components/els_pkc/doc/mimxrt/html/a00116.html" projectpath="component/els_pkc/doc/mimxrt/html"/>
        <file category="doc" name="components/els_pkc/doc/mimxrt/html/a00155.html" projectpath="component/els_pkc/doc/mimxrt/html"/>
        <file category="other" name="components/els_pkc/doc/mimxrt/html/a00155.js" projectpath="component/els_pkc/doc/mimxrt/html"/>
        <file category="doc" name="components/els_pkc/doc/mimxrt/html/a00158.html" projectpath="component/els_pkc/doc/mimxrt/html"/>
        <file category="other" name="components/els_pkc/doc/mimxrt/html/a00158.js" projectpath="component/els_pkc/doc/mimxrt/html"/>
        <file category="doc" name="components/els_pkc/doc/mimxrt/html/a00161.html" projectpath="component/els_pkc/doc/mimxrt/html"/>
        <file category="other" name="components/els_pkc/doc/mimxrt/html/a00161.js" projectpath="component/els_pkc/doc/mimxrt/html"/>
        <file category="doc" name="components/els_pkc/doc/mimxrt/html/a00164.html" projectpath="component/els_pkc/doc/mimxrt/html"/>
        <file category="other" name="components/els_pkc/doc/mimxrt/html/a00164.js" projectpath="component/els_pkc/doc/mimxrt/html"/>
        <file category="doc" name="components/els_pkc/doc/mimxrt/html/a00167.html" projectpath="component/els_pkc/doc/mimxrt/html"/>
        <file category="other" name="components/els_pkc/doc/mimxrt/html/a00167.js" projectpath="component/els_pkc/doc/mimxrt/html"/>
        <file category="doc" name="components/els_pkc/doc/mimxrt/html/a00170.html" projectpath="component/els_pkc/doc/mimxrt/html"/>
        <file category="other" name="components/els_pkc/doc/mimxrt/html/a00170.js" projectpath="component/els_pkc/doc/mimxrt/html"/>
        <file category="doc" name="components/els_pkc/doc/mimxrt/html/a00173.html" projectpath="component/els_pkc/doc/mimxrt/html"/>
        <file category="other" name="components/els_pkc/doc/mimxrt/html/a00173.js" projectpath="component/els_pkc/doc/mimxrt/html"/>
        <file category="doc" name="components/els_pkc/doc/mimxrt/html/a00176.html" projectpath="component/els_pkc/doc/mimxrt/html"/>
        <file category="other" name="components/els_pkc/doc/mimxrt/html/a00176.js" projectpath="component/els_pkc/doc/mimxrt/html"/>
        <file category="doc" name="components/els_pkc/doc/mimxrt/html/a00179.html" projectpath="component/els_pkc/doc/mimxrt/html"/>
        <file category="other" name="components/els_pkc/doc/mimxrt/html/a00179.js" projectpath="component/els_pkc/doc/mimxrt/html"/>
        <file category="doc" name="components/els_pkc/doc/mimxrt/html/a00182.html" projectpath="component/els_pkc/doc/mimxrt/html"/>
        <file category="other" name="components/els_pkc/doc/mimxrt/html/a00182.js" projectpath="component/els_pkc/doc/mimxrt/html"/>
        <file category="doc" name="components/els_pkc/doc/mimxrt/html/a00185.html" projectpath="component/els_pkc/doc/mimxrt/html"/>
        <file category="other" name="components/els_pkc/doc/mimxrt/html/a00185.js" projectpath="component/els_pkc/doc/mimxrt/html"/>
        <file category="doc" name="components/els_pkc/doc/mimxrt/html/a00188.html" projectpath="component/els_pkc/doc/mimxrt/html"/>
        <file category="other" name="components/els_pkc/doc/mimxrt/html/a00188.js" projectpath="component/els_pkc/doc/mimxrt/html"/>
        <file category="doc" name="components/els_pkc/doc/mimxrt/html/a00206.html" projectpath="component/els_pkc/doc/mimxrt/html"/>
        <file category="other" name="components/els_pkc/doc/mimxrt/html/a00206.js" projectpath="component/els_pkc/doc/mimxrt/html"/>
        <file category="doc" name="components/els_pkc/doc/mimxrt/html/a00209.html" projectpath="component/els_pkc/doc/mimxrt/html"/>
        <file category="other" name="components/els_pkc/doc/mimxrt/html/a00209.js" projectpath="component/els_pkc/doc/mimxrt/html"/>
        <file category="doc" name="components/els_pkc/doc/mimxrt/html/a00212.html" projectpath="component/els_pkc/doc/mimxrt/html"/>
        <file category="other" name="components/els_pkc/doc/mimxrt/html/a00212.js" projectpath="component/els_pkc/doc/mimxrt/html"/>
        <file category="doc" name="components/els_pkc/doc/mimxrt/html/a00215.html" projectpath="component/els_pkc/doc/mimxrt/html"/>
        <file category="other" name="components/els_pkc/doc/mimxrt/html/a00215.js" projectpath="component/els_pkc/doc/mimxrt/html"/>
        <file category="doc" name="components/els_pkc/doc/mimxrt/html/a00218.html" projectpath="component/els_pkc/doc/mimxrt/html"/>
        <file category="other" name="components/els_pkc/doc/mimxrt/html/a00218.js" projectpath="component/els_pkc/doc/mimxrt/html"/>
        <file category="doc" name="components/els_pkc/doc/mimxrt/html/a00221.html" projectpath="component/els_pkc/doc/mimxrt/html"/>
        <file category="other" name="components/els_pkc/doc/mimxrt/html/a00221.js" projectpath="component/els_pkc/doc/mimxrt/html"/>
        <file category="doc" name="components/els_pkc/doc/mimxrt/html/a00224.html" projectpath="component/els_pkc/doc/mimxrt/html"/>
        <file category="other" name="components/els_pkc/doc/mimxrt/html/a00224.js" projectpath="component/els_pkc/doc/mimxrt/html"/>
        <file category="doc" name="components/els_pkc/doc/mimxrt/html/a00227.html" projectpath="component/els_pkc/doc/mimxrt/html"/>
        <file category="other" name="components/els_pkc/doc/mimxrt/html/a00227.js" projectpath="component/els_pkc/doc/mimxrt/html"/>
        <file category="doc" name="components/els_pkc/doc/mimxrt/html/a00230.html" projectpath="component/els_pkc/doc/mimxrt/html"/>
        <file category="other" name="components/els_pkc/doc/mimxrt/html/a00230.js" projectpath="component/els_pkc/doc/mimxrt/html"/>
        <file category="doc" name="components/els_pkc/doc/mimxrt/html/a00233.html" projectpath="component/els_pkc/doc/mimxrt/html"/>
        <file category="other" name="components/els_pkc/doc/mimxrt/html/a00233.js" projectpath="component/els_pkc/doc/mimxrt/html"/>
        <file category="doc" name="components/els_pkc/doc/mimxrt/html/a00236.html" projectpath="component/els_pkc/doc/mimxrt/html"/>
        <file category="other" name="components/els_pkc/doc/mimxrt/html/a00236.js" projectpath="component/els_pkc/doc/mimxrt/html"/>
        <file category="doc" name="components/els_pkc/doc/mimxrt/html/a00239.html" projectpath="component/els_pkc/doc/mimxrt/html"/>
        <file category="other" name="components/els_pkc/doc/mimxrt/html/a00239.js" projectpath="component/els_pkc/doc/mimxrt/html"/>
        <file category="doc" name="components/els_pkc/doc/mimxrt/html/a00242.html" projectpath="component/els_pkc/doc/mimxrt/html"/>
        <file category="other" name="components/els_pkc/doc/mimxrt/html/a00242.js" projectpath="component/els_pkc/doc/mimxrt/html"/>
        <file category="doc" name="components/els_pkc/doc/mimxrt/html/a00245.html" projectpath="component/els_pkc/doc/mimxrt/html"/>
        <file category="other" name="components/els_pkc/doc/mimxrt/html/a00245.js" projectpath="component/els_pkc/doc/mimxrt/html"/>
        <file category="doc" name="components/els_pkc/doc/mimxrt/html/a00248.html" projectpath="component/els_pkc/doc/mimxrt/html"/>
        <file category="other" name="components/els_pkc/doc/mimxrt/html/a00248.js" projectpath="component/els_pkc/doc/mimxrt/html"/>
        <file category="doc" name="components/els_pkc/doc/mimxrt/html/a00266.html" projectpath="component/els_pkc/doc/mimxrt/html"/>
        <file category="other" name="components/els_pkc/doc/mimxrt/html/a00266.js" projectpath="component/els_pkc/doc/mimxrt/html"/>
        <file category="doc" name="components/els_pkc/doc/mimxrt/html/a00269.html" projectpath="component/els_pkc/doc/mimxrt/html"/>
        <file category="other" name="components/els_pkc/doc/mimxrt/html/a00269.js" projectpath="component/els_pkc/doc/mimxrt/html"/>
        <file category="doc" name="components/els_pkc/doc/mimxrt/html/a00272.html" projectpath="component/els_pkc/doc/mimxrt/html"/>
        <file category="other" name="components/els_pkc/doc/mimxrt/html/a00272.js" projectpath="component/els_pkc/doc/mimxrt/html"/>
        <file category="doc" name="components/els_pkc/doc/mimxrt/html/a00275.html" projectpath="component/els_pkc/doc/mimxrt/html"/>
        <file category="other" name="components/els_pkc/doc/mimxrt/html/a00275.js" projectpath="component/els_pkc/doc/mimxrt/html"/>
        <file category="doc" name="components/els_pkc/doc/mimxrt/html/a00278.html" projectpath="component/els_pkc/doc/mimxrt/html"/>
        <file category="other" name="components/els_pkc/doc/mimxrt/html/a00278.js" projectpath="component/els_pkc/doc/mimxrt/html"/>
        <file category="doc" name="components/els_pkc/doc/mimxrt/html/a00281.html" projectpath="component/els_pkc/doc/mimxrt/html"/>
        <file category="other" name="components/els_pkc/doc/mimxrt/html/a00281.js" projectpath="component/els_pkc/doc/mimxrt/html"/>
        <file category="doc" name="components/els_pkc/doc/mimxrt/html/a00284.html" projectpath="component/els_pkc/doc/mimxrt/html"/>
        <file category="other" name="components/els_pkc/doc/mimxrt/html/a00284.js" projectpath="component/els_pkc/doc/mimxrt/html"/>
        <file category="doc" name="components/els_pkc/doc/mimxrt/html/a00287.html" projectpath="component/els_pkc/doc/mimxrt/html"/>
        <file category="other" name="components/els_pkc/doc/mimxrt/html/a00287.js" projectpath="component/els_pkc/doc/mimxrt/html"/>
        <file category="doc" name="components/els_pkc/doc/mimxrt/html/a00329.html" projectpath="component/els_pkc/doc/mimxrt/html"/>
        <file category="other" name="components/els_pkc/doc/mimxrt/html/a00329.js" projectpath="component/els_pkc/doc/mimxrt/html"/>
        <file category="doc" name="components/els_pkc/doc/mimxrt/html/a00332.html" projectpath="component/els_pkc/doc/mimxrt/html"/>
        <file category="other" name="components/els_pkc/doc/mimxrt/html/a00332.js" projectpath="component/els_pkc/doc/mimxrt/html"/>
        <file category="doc" name="components/els_pkc/doc/mimxrt/html/a00335.html" projectpath="component/els_pkc/doc/mimxrt/html"/>
        <file category="other" name="components/els_pkc/doc/mimxrt/html/a00335.js" projectpath="component/els_pkc/doc/mimxrt/html"/>
        <file category="doc" name="components/els_pkc/doc/mimxrt/html/a00338_source.html" projectpath="component/els_pkc/doc/mimxrt/html"/>
        <file category="doc" name="components/els_pkc/doc/mimxrt/html/a00341_source.html" projectpath="component/els_pkc/doc/mimxrt/html"/>
        <file category="doc" name="components/els_pkc/doc/mimxrt/html/a00344.html" projectpath="component/els_pkc/doc/mimxrt/html"/>
        <file category="doc" name="components/els_pkc/doc/mimxrt/html/a00344_source.html" projectpath="component/els_pkc/doc/mimxrt/html"/>
        <file category="doc" name="components/els_pkc/doc/mimxrt/html/a00350.html" projectpath="component/els_pkc/doc/mimxrt/html"/>
        <file category="doc" name="components/els_pkc/doc/mimxrt/html/a00350_source.html" projectpath="component/els_pkc/doc/mimxrt/html"/>
        <file category="doc" name="components/els_pkc/doc/mimxrt/html/a00353_source.html" projectpath="component/els_pkc/doc/mimxrt/html"/>
        <file category="doc" name="components/els_pkc/doc/mimxrt/html/a00356.html" projectpath="component/els_pkc/doc/mimxrt/html"/>
        <file category="other" name="components/els_pkc/doc/mimxrt/html/a00356.js" projectpath="component/els_pkc/doc/mimxrt/html"/>
        <file category="doc" name="components/els_pkc/doc/mimxrt/html/a00356_source.html" projectpath="component/els_pkc/doc/mimxrt/html"/>
        <file category="doc" name="components/els_pkc/doc/mimxrt/html/a00359.html" projectpath="component/els_pkc/doc/mimxrt/html"/>
        <file category="other" name="components/els_pkc/doc/mimxrt/html/a00359.js" projectpath="component/els_pkc/doc/mimxrt/html"/>
        <file category="doc" name="components/els_pkc/doc/mimxrt/html/a00359_source.html" projectpath="component/els_pkc/doc/mimxrt/html"/>
        <file category="doc" name="components/els_pkc/doc/mimxrt/html/a00362.html" projectpath="component/els_pkc/doc/mimxrt/html"/>
        <file category="other" name="components/els_pkc/doc/mimxrt/html/a00362.js" projectpath="component/els_pkc/doc/mimxrt/html"/>
        <file category="doc" name="components/els_pkc/doc/mimxrt/html/a00362_source.html" projectpath="component/els_pkc/doc/mimxrt/html"/>
