vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MIMXRT758S_DFP.pdsc
    <component Cclass="MIMXRT758S els_pkc" Cgroup="els_pkc_examples_aead" Cversion="1.9.0" condition="component.els_pkc.examples_aead.condition_id">
      <description>Component els_pkc_test</description>
      <files>
        <file category="sourceC" name="components/els_pkc/examples/mcuxClAeadModes/mcuxClAeadModes_Els_Ccm_Aes128_Multipart_example.c" projectpath="component/els_pkc/examples/mcuxClAeadModes"/>
        <file category="sourceC" name="components/els_pkc/examples/mcuxClAeadModes/mcuxClAeadModes_Els_Ccm_Aes128_Oneshot_example.c" projectpath="component/els_pkc/examples/mcuxClAeadModes"/>
        <file category="sourceC" name="components/els_pkc/examples/mcuxClAeadModes/mcuxClAeadModes_Els_Gcm_Aes128_Oneshot_example.c" projectpath="component/els_pkc/examples/mcuxClAeadModes"/>
        <file category="include" name="components/els_pkc/"/>
        <file category="include" name="components/els_pkc/examples/mcuxCsslFlowProtection/inc/"/>
        <file category="include" name="components/els_pkc/examples/mcuxCsslMemory/inc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxClExample/inc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxClBuffer/inc/"/>
      </files>
    </component>
    <component Cclass="MIMXRT758S els_pkc" Cgroup="els_pkc_examples_cipher" Cversion="1.9.0" condition="component.els_pkc.examples_cipher_modes.condition_id">
      <description>Component els_pkc_test</description>
      <files>
        <file category="sourceC" name="components/els_pkc/examples/mcuxClCipherModes/mcuxClCipherModes_Els_Cbc_Aes128_Multipart_example.c" projectpath="component/els_pkc/examples/mcuxClCipherModes"/>
        <file category="sourceC" name="components/els_pkc/examples/mcuxClCipherModes/mcuxClCipherModes_Els_Cbc_Aes128_Oneshot_example.c" projectpath="component/els_pkc/examples/mcuxClCipherModes"/>
        <file category="sourceC" name="components/els_pkc/examples/mcuxClCipherModes/mcuxClCipherModes_Els_Cbc_Aes128_Oneshot_PaddingZero_example.c" projectpath="component/els_pkc/examples/mcuxClCipherModes"/>
        <file category="sourceC" name="components/els_pkc/examples/mcuxClCipherModes/mcuxClCipherModes_Els_Ctr_Aes128_Multipart_example.c" projectpath="component/els_pkc/examples/mcuxClCipherModes"/>
        <file category="sourceC" name="components/els_pkc/examples/mcuxClCipherModes/mcuxClCipherModes_Els_Ctr_Aes128_Oneshot_example.c" projectpath="component/els_pkc/examples/mcuxClCipherModes"/>
        <file category="sourceC" name="components/els_pkc/examples/mcuxClCipherModes/mcuxClCipherModes_Els_Ecb_Aes128_Multipart_example.c" projectpath="component/els_pkc/examples/mcuxClCipherModes"/>
        <file category="sourceC" name="components/els_pkc/examples/mcuxClCipherModes/mcuxClCipherModes_Els_Ecb_Aes128_Multipart_PaddingPKCS7_example.c" projectpath="component/els_pkc/examples/mcuxClCipherModes"/>
        <file category="sourceC" name="components/els_pkc/examples/mcuxClCipherModes/mcuxClCipherModes_Els_Ecb_Aes128_Oneshot_example.c" projectpath="component/els_pkc/examples/mcuxClCipherModes"/>
        <file category="sourceC" name="components/els_pkc/examples/mcuxClCipherModes/mcuxClCipherModes_Els_Ecb_Aes128_Oneshot_PaddingPKCS7_example.c" projectpath="component/els_pkc/examples/mcuxClCipherModes"/>
        <file category="sourceC" name="components/els_pkc/examples/mcuxClCipherModes/mcuxClCipherModes_Els_Ecb_Aes128_Oneshot_PaddingZero_example.c" projectpath="component/els_pkc/examples/mcuxClCipherModes"/>
        <file category="include" name="components/els_pkc/"/>
        <file category="include" name="components/els_pkc/examples/mcuxCsslFlowProtection/inc/"/>
        <file category="include" name="components/els_pkc/examples/mcuxCsslMemory/inc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxClExample/inc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxClBuffer/inc/"/>
      </files>
    </component>
    <component Cclass="MIMXRT758S els_pkc" Cgroup="els_pkc_examples_ecc" Cversion="1.9.0" condition="component.els_pkc.examples_ecc.condition_id">
      <description>Component els_pkc_test</description>
      <files>
        <file category="sourceC" name="components/els_pkc/examples/mcuxClEcc/mcuxClEcc_EdDSA_Ed25519ctx_example.c" projectpath="component/els_pkc/examples/mcuxClEcc"/>
        <file category="sourceC" name="components/els_pkc/examples/mcuxClEcc/mcuxClEcc_EdDSA_Ed25519ph_example.c" projectpath="component/els_pkc/examples/mcuxClEcc"/>
        <file category="sourceC" name="components/els_pkc/examples/mcuxClEcc/mcuxClEcc_EdDSA_Ed25519_example.c" projectpath="component/els_pkc/examples/mcuxClEcc"/>
        <file category="sourceC" name="components/els_pkc/examples/mcuxClEcc/mcuxClEcc_EdDSA_GenerateSignature_Ed25519_example.c" projectpath="component/els_pkc/examples/mcuxClEcc"/>
        <file category="sourceC" name="components/els_pkc/examples/mcuxClEcc/mcuxClEcc_EdDSA_VerifySignature_Ed25519_example.c" projectpath="component/els_pkc/examples/mcuxClEcc"/>
        <file category="sourceC" name="components/els_pkc/examples/mcuxClEcc/mcuxClEcc_MontDH_Curve25519_example.c" projectpath="component/els_pkc/examples/mcuxClEcc"/>
        <file category="sourceC" name="components/els_pkc/examples/mcuxClEcc/mcuxClEcc_MontDH_Curve448_example.c" projectpath="component/els_pkc/examples/mcuxClEcc"/>
        <file category="include" name="components/els_pkc/"/>
        <file category="include" name="components/els_pkc/examples/mcuxCsslFlowProtection/inc/"/>
        <file category="include" name="components/els_pkc/examples/mcuxCsslMemory/inc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxClExample/inc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxClBuffer/inc/"/>
      </files>
    </component>
    <component Cclass="MIMXRT758S els_pkc" Cgroup="els_pkc_examples_els" Cversion="1.9.0" condition="component.els_pkc.examples_els.condition_id">
      <description>Component els_pkc_test</description>
      <files>
        <file category="sourceC" name="components/els_pkc/examples/mcuxClEls/mcuxClEls_Cipher_Aes128_Cbc_Encrypt_example.c" projectpath="component/els_pkc/examples/mcuxClEls"/>
        <file category="sourceC" name="components/els_pkc/examples/mcuxClEls/mcuxClEls_Cipher_Aes128_Ecb_Encrypt_example.c" projectpath="component/els_pkc/examples/mcuxClEls"/>
        <file category="sourceC" name="components/els_pkc/examples/mcuxClEls/mcuxClEls_Common_Get_Info_example.c" projectpath="component/els_pkc/examples/mcuxClEls"/>
        <file category="sourceC" name="components/els_pkc/examples/mcuxClEls/mcuxClEls_Ecc_Keygen_Sign_Verify_example.c" projectpath="component/els_pkc/examples/mcuxClEls"/>
        <file category="sourceC" name="components/els_pkc/examples/mcuxClEls/mcuxClEls_Hash_HW_Security_Counter_example.c" projectpath="component/els_pkc/examples/mcuxClEls"/>
        <file category="sourceC" name="components/els_pkc/examples/mcuxClEls/mcuxClEls_Hash_Sha224_One_Block_example.c" projectpath="component/els_pkc/examples/mcuxClEls"/>
        <file category="sourceC" name="components/els_pkc/examples/mcuxClEls/mcuxClEls_Hash_Sha256_One_Block_example.c" projectpath="component/els_pkc/examples/mcuxClEls"/>
        <file category="sourceC" name="components/els_pkc/examples/mcuxClEls/mcuxClEls_Hash_Sha384_One_Block_example.c" projectpath="component/els_pkc/examples/mcuxClEls"/>
        <file category="sourceC" name="components/els_pkc/examples/mcuxClEls/mcuxClEls_Hash_Sha512_One_Block_example.c" projectpath="component/els_pkc/examples/mcuxClEls"/>
        <file category="sourceC" name="components/els_pkc/examples/mcuxClEls/mcuxClEls_Rng_Prng_Get_Random_example.c" projectpath="component/els_pkc/examples/mcuxClEls"/>
        <file category="sourceC" name="components/els_pkc/examples/mcuxClEls/mcuxClEls_Tls_Master_Key_Session_Keys_example.c" projectpath="component/els_pkc/examples/mcuxClEls"/>
        <file category="sourceC" name="components/els_pkc/examples/mcuxClRandomModes/mcuxClRandomModes_ELS_example.c" projectpath="component/els_pkc/examples/mcuxClRandomModes"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClExample/inc/mcuxClExample_ELS_Helper.h" projectpath="component/els_pkc/src/comps/mcuxClExample/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClExample/inc/mcuxClExample_ELS_Key_Helper.h" projectpath="component/els_pkc/src/comps/mcuxClExample/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClExample/inc/mcuxClExample_Key_Helper.h" projectpath="component/els_pkc/src/comps/mcuxClExample/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClExample/inc/mcuxClExample_RFC3394_Helper.h" projectpath="component/els_pkc/src/comps/mcuxClExample/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClExample/inc/mcuxClExample_RNG_Helper.h" projectpath="component/els_pkc/src/comps/mcuxClExample/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClExample/inc/mcuxClExample_Session_Helper.h" projectpath="component/els_pkc/src/comps/mcuxClExample/inc"/>
        <file category="include" name="components/els_pkc/"/>
        <file category="include" name="components/els_pkc/examples/mcuxCsslFlowProtection/inc/"/>
        <file category="include" name="components/els_pkc/examples/mcuxCsslMemory/inc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxClExample/inc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxClBuffer/inc/"/>
      </files>
    </component>
    <component Cclass="MIMXRT758S els_pkc" Cgroup="els_pkc_examples_flow_protection" Cversion="1.9.0" condition="component.els_pkc.examples_flow_protection.condition_id">
      <description>Component els_pkc_test</description>
      <files>
        <file category="sourceC" name="components/els_pkc/examples/mcuxCsslFlowProtection/mcuxCsslFlowProtection_example.c" projectpath="component/els_pkc/examples/mcuxCsslFlowProtection"/>
        <file category="header" name="components/els_pkc/examples/mcuxCsslFlowProtection/inc/mcuxCsslExamples.h" projectpath="component/els_pkc/examples/mcuxCsslFlowProtection/inc"/>
        <file category="include" name="components/els_pkc/"/>
        <file category="include" name="components/els_pkc/examples/mcuxCsslFlowProtection/inc/"/>
        <file category="include" name="components/els_pkc/examples/mcuxCsslMemory/inc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxClExample/inc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxClBuffer/inc/"/>
      </files>
    </component>
