vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MIMXRT758S_DFP.pdsc
    <component Cclass="MIMXRT758S els_pkc" Cgroup="els_pkc_key_derivation" Cversion="1.9.0" condition="component.els_pkc.key_derivation.condition_id">
      <description>Component els_pkc.key_derivation</description>
      <files>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClKey/src/mcuxClKey_agreement.c" projectpath="component/els_pkc/src/comps/mcuxClKey/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClKey/src/mcuxClKey_agreement_selftest.c" projectpath="component/els_pkc/src/comps/mcuxClKey/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClKey/src/mcuxClKey_Derivation.c" projectpath="component/els_pkc/src/comps/mcuxClKey/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClKey/src/mcuxClKey_Derivation_HKDF.c" projectpath="component/els_pkc/src/comps/mcuxClKey/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClKey/src/mcuxClKey_Derivation_NIST_SP800_108.c" projectpath="component/els_pkc/src/comps/mcuxClKey/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClKey/src/mcuxClKey_Derivation_NIST_SP800_56C.c" projectpath="component/els_pkc/src/comps/mcuxClKey/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClKey/src/mcuxClKey_Derivation_PBKDF2.c" projectpath="component/els_pkc/src/comps/mcuxClKey/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClKey/src/mcuxClKey_generate_keypair.c" projectpath="component/els_pkc/src/comps/mcuxClKey/src"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClKey/inc/mcuxClKey_DerivationAlgorithms.h" projectpath="component/els_pkc/src/comps/mcuxClKey/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClKey/inc/mcuxClKey_DerivationAlgorithms_HKDF.h" projectpath="component/els_pkc/src/comps/mcuxClKey/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClKey/inc/mcuxClKey_DerivationAlgorithms_NIST_SP800_108.h" projectpath="component/els_pkc/src/comps/mcuxClKey/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClKey/inc/mcuxClKey_DerivationAlgorithms_NIST_SP800_56C.h" projectpath="component/els_pkc/src/comps/mcuxClKey/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClKey/inc/mcuxClKey_DerivationAlgorithms_PBKDF2.h" projectpath="component/els_pkc/src/comps/mcuxClKey/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClKey/inc/internal/mcuxClKey_Derivation_Helper.h" projectpath="component/els_pkc/src/comps/mcuxClKey/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClKey/inc/internal/mcuxClKey_DerivationAlgorithms_NIST_SP800_108_Internal.h" projectpath="component/els_pkc/src/comps/mcuxClKey/inc/internal"/>
        <file category="include" name="components/els_pkc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxClKey/inc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxClKey/inc/internal/"/>
      </files>
    </component>
    <component Cclass="MIMXRT758S els_pkc" Cgroup="els_pkc_mac" Cversion="1.9.0" condition="component.els_pkc.mac.condition_id">
      <description>Component els_pkc.mac</description>
      <files>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClMac/src/mcuxClMac.c" projectpath="component/els_pkc/src/comps/mcuxClMac/src"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClMac/inc/mcuxClMac.h" projectpath="component/els_pkc/src/comps/mcuxClMac/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClMac/inc/mcuxClMac_Constants.h" projectpath="component/els_pkc/src/comps/mcuxClMac/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClMac/inc/mcuxClMac_Functions.h" projectpath="component/els_pkc/src/comps/mcuxClMac/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClMac/inc/mcuxClMac_Types.h" projectpath="component/els_pkc/src/comps/mcuxClMac/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClMac/inc/internal/mcuxClMac_Ctx.h" projectpath="component/els_pkc/src/comps/mcuxClMac/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClMac/inc/internal/mcuxClMac_Internal_Constants.h" projectpath="component/els_pkc/src/comps/mcuxClMac/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClMac/inc/internal/mcuxClMac_Internal_Functions.h" projectpath="component/els_pkc/src/comps/mcuxClMac/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClMac/inc/internal/mcuxClMac_Internal_Types.h" projectpath="component/els_pkc/src/comps/mcuxClMac/inc/internal"/>
        <file category="include" name="components/els_pkc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxClMac/inc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxClMac/inc/internal/"/>
      </files>
    </component>
    <component Cclass="MIMXRT758S els_pkc" Cgroup="els_pkc_mac_modes" Cversion="1.9.0" condition="component.els_pkc.mac_modes.condition_id">
      <description>Component els_pkc.mac_modes</description>
      <files>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClMacModes/src/mcuxClMacModes_Common.c" projectpath="component/els_pkc/src/comps/mcuxClMacModes/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClMacModes/src/mcuxClMacModes_Common_Modes.c" projectpath="component/els_pkc/src/comps/mcuxClMacModes/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClMacModes/src/mcuxClMacModes_Els_Cbcmac.c" projectpath="component/els_pkc/src/comps/mcuxClMacModes/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClMacModes/src/mcuxClMacModes_Els_Cmac.c" projectpath="component/els_pkc/src/comps/mcuxClMacModes/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClMacModes/src/mcuxClMacModes_Els_Functions.c" projectpath="component/els_pkc/src/comps/mcuxClMacModes/src"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClMacModes/inc/mcuxClMacModes.h" projectpath="component/els_pkc/src/comps/mcuxClMacModes/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClMacModes/inc/mcuxClMacModes_Constants.h" projectpath="component/els_pkc/src/comps/mcuxClMacModes/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClMacModes/inc/mcuxClMacModes_Functions.h" projectpath="component/els_pkc/src/comps/mcuxClMacModes/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClMacModes/inc/mcuxClMacModes_Modes.h" projectpath="component/els_pkc/src/comps/mcuxClMacModes/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClMacModes/inc/internal/mcuxClMacModes_Common_Algorithms.h" projectpath="component/els_pkc/src/comps/mcuxClMacModes/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClMacModes/inc/internal/mcuxClMacModes_Common_Constants.h" projectpath="component/els_pkc/src/comps/mcuxClMacModes/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClMacModes/inc/internal/mcuxClMacModes_Common_Functions.h" projectpath="component/els_pkc/src/comps/mcuxClMacModes/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClMacModes/inc/internal/mcuxClMacModes_Common_Memory.h" projectpath="component/els_pkc/src/comps/mcuxClMacModes/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClMacModes/inc/internal/mcuxClMacModes_Common_Types.h" projectpath="component/els_pkc/src/comps/mcuxClMacModes/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClMacModes/inc/internal/mcuxClMacModes_Common_Wa.h" projectpath="component/els_pkc/src/comps/mcuxClMacModes/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClMacModes/inc/internal/mcuxClMacModes_Els_Cbcmac.h" projectpath="component/els_pkc/src/comps/mcuxClMacModes/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClMacModes/inc/internal/mcuxClMacModes_Els_Cmac.h" projectpath="component/els_pkc/src/comps/mcuxClMacModes/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClMacModes/inc/internal/mcuxClMacModes_Els_Ctx.h" projectpath="component/els_pkc/src/comps/mcuxClMacModes/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClMacModes/inc/internal/mcuxClMacModes_Els_Types.h" projectpath="component/els_pkc/src/comps/mcuxClMacModes/inc/internal"/>
        <file category="include" name="components/els_pkc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxClMacModes/inc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxClMacModes/inc/internal/"/>
      </files>
    </component>
    <component Cclass="MIMXRT758S els_pkc" Cgroup="els_pkc_math" Cversion="1.9.0" condition="component.els_pkc.math.condition_id">
      <description>Component els_pkc.math</description>
      <files>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClMath/src/mcuxClMath_ExactDivide.c" projectpath="component/els_pkc/src/comps/mcuxClMath/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClMath/src/mcuxClMath_ExactDivideOdd.c" projectpath="component/els_pkc/src/comps/mcuxClMath/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClMath/src/mcuxClMath_ExactDivideOdd_FUP.c" projectpath="component/els_pkc/src/comps/mcuxClMath/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClMath/src/mcuxClMath_ModExp_SqrMultL2R.c" projectpath="component/els_pkc/src/comps/mcuxClMath/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClMath/src/mcuxClMath_ModInv.c" projectpath="component/els_pkc/src/comps/mcuxClMath/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClMath/src/mcuxClMath_ModInv_FUP.c" projectpath="component/els_pkc/src/comps/mcuxClMath/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClMath/src/mcuxClMath_NDash.c" projectpath="component/els_pkc/src/comps/mcuxClMath/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClMath/src/mcuxClMath_NDash_FUP.c" projectpath="component/els_pkc/src/comps/mcuxClMath/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClMath/src/mcuxClMath_QDash.c" projectpath="component/els_pkc/src/comps/mcuxClMath/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClMath/src/mcuxClMath_QDash_FUP.c" projectpath="component/els_pkc/src/comps/mcuxClMath/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClMath/src/mcuxClMath_ReduceModEven.c" projectpath="component/els_pkc/src/comps/mcuxClMath/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClMath/src/mcuxClMath_SecModExp.c" projectpath="component/els_pkc/src/comps/mcuxClMath/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClMath/src/mcuxClMath_SecModExp_FUP.c" projectpath="component/els_pkc/src/comps/mcuxClMath/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClMath/src/mcuxClMath_Utils.c" projectpath="component/els_pkc/src/comps/mcuxClMath/src"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClMath/inc/mcuxClMath.h" projectpath="component/els_pkc/src/comps/mcuxClMath/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClMath/inc/mcuxClMath_ExactDivideOdd_FUP.h" projectpath="component/els_pkc/src/comps/mcuxClMath/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClMath/inc/mcuxClMath_Functions.h" projectpath="component/els_pkc/src/comps/mcuxClMath/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClMath/inc/mcuxClMath_ModInv_FUP.h" projectpath="component/els_pkc/src/comps/mcuxClMath/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClMath/inc/mcuxClMath_NDash_FUP.h" projectpath="component/els_pkc/src/comps/mcuxClMath/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClMath/inc/mcuxClMath_QDash_FUP.h" projectpath="component/els_pkc/src/comps/mcuxClMath/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClMath/inc/mcuxClMath_SecModExp_FUP.h" projectpath="component/els_pkc/src/comps/mcuxClMath/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClMath/inc/mcuxClMath_Types.h" projectpath="component/els_pkc/src/comps/mcuxClMath/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClMath/inc/internal/mcuxClMath_ExactDivideOdd_FUP.h" projectpath="component/els_pkc/src/comps/mcuxClMath/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClMath/inc/internal/mcuxClMath_Internal_ExactDivideOdd.h" projectpath="component/els_pkc/src/comps/mcuxClMath/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClMath/inc/internal/mcuxClMath_Internal_ModInv.h" projectpath="component/els_pkc/src/comps/mcuxClMath/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClMath/inc/internal/mcuxClMath_Internal_NDash.h" projectpath="component/els_pkc/src/comps/mcuxClMath/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClMath/inc/internal/mcuxClMath_Internal_QDash.h" projectpath="component/els_pkc/src/comps/mcuxClMath/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClMath/inc/internal/mcuxClMath_Internal_SecModExp.h" projectpath="component/els_pkc/src/comps/mcuxClMath/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClMath/inc/internal/mcuxClMath_Internal_Utils.h" projectpath="component/els_pkc/src/comps/mcuxClMath/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClMath/inc/internal/mcuxClMath_ModInv_FUP.h" projectpath="component/els_pkc/src/comps/mcuxClMath/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClMath/inc/internal/mcuxClMath_NDash_FUP.h" projectpath="component/els_pkc/src/comps/mcuxClMath/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClMath/inc/internal/mcuxClMath_QDash_FUP.h" projectpath="component/els_pkc/src/comps/mcuxClMath/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClMath/inc/internal/mcuxClMath_SecModExp_FUP.h" projectpath="component/els_pkc/src/comps/mcuxClMath/inc/internal"/>
        <file category="include" name="components/els_pkc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxClMath/inc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxClMath/inc/internal/"/>
      </files>
    </component>
