vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MIMXRT758S_DFP.pdsc
    <component Cclass="MIMXRT758S els_pkc" Cgroup="els_pkc_oscca_sm3" Cversion="1.9.0" condition="component.els_pkc.oscca_sm3.condition_id">
      <description>Component els_pkc.oscca_sm3</description>
      <files>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClOsccaSm3/src/mcuxClOsccaSm3_core_sm3.c" projectpath="component/els_pkc/src/comps/mcuxClOsccaSm3/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClOsccaSm3/src/mcuxClOsccaSm3_internal_sm3.c" projectpath="component/els_pkc/src/comps/mcuxClOsccaSm3/src"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClOsccaSm3/inc/mcuxClOsccaSm3.h" projectpath="component/els_pkc/src/comps/mcuxClOsccaSm3/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClOsccaSm3/inc/mcuxClOsccaSm3_Algorithms.h" projectpath="component/els_pkc/src/comps/mcuxClOsccaSm3/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClOsccaSm3/inc/mcuxClOsccaSm3_Constants.h" projectpath="component/els_pkc/src/comps/mcuxClOsccaSm3/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClOsccaSm3/inc/internal/mcuxClOsccaSm3_Core_sm3.h" projectpath="component/els_pkc/src/comps/mcuxClOsccaSm3/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClOsccaSm3/inc/internal/mcuxClOsccaSm3_Internal.h" projectpath="component/els_pkc/src/comps/mcuxClOsccaSm3/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClOsccaSm3/inc/internal/mcuxClOsccaSm3_Internal_sm3.h" projectpath="component/els_pkc/src/comps/mcuxClOsccaSm3/inc/internal"/>
        <file category="include" name="components/els_pkc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxClOsccaSm3/inc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxClOsccaSm3/inc/internal/"/>
      </files>
    </component>
    <component Cclass="MIMXRT758S els_pkc" Cgroup="els_pkc_oscca_sm4" Cversion="1.9.0" condition="component.els_pkc.oscca_sm4.condition_id">
      <description>Component els_pkc.oscca_sm4</description>
      <files>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClOsccaSm4/src/mcuxClOsccaSm4_CommonOperations.c" projectpath="component/els_pkc/src/comps/mcuxClOsccaSm4/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClOsccaSm4/src/mcuxClOsccaSm4_Core.c" projectpath="component/els_pkc/src/comps/mcuxClOsccaSm4/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClOsccaSm4/src/mcuxClOsccaSm4_KeyTypes.c" projectpath="component/els_pkc/src/comps/mcuxClOsccaSm4/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClOsccaSm4/src/mcuxClOsccaSm4_LoadKey.c" projectpath="component/els_pkc/src/comps/mcuxClOsccaSm4/src"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClOsccaSm4/inc/mcuxClOsccaSm4.h" projectpath="component/els_pkc/src/comps/mcuxClOsccaSm4/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClOsccaSm4/inc/mcuxClOsccaSm4_KeyTypes.h" projectpath="component/els_pkc/src/comps/mcuxClOsccaSm4/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClOsccaSm4/inc/internal/mcuxClOsccaSm4_Internal.h" projectpath="component/els_pkc/src/comps/mcuxClOsccaSm4/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClOsccaSm4/inc/internal/mcuxClOsccaSm4_Internal_Constants.h" projectpath="component/els_pkc/src/comps/mcuxClOsccaSm4/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClOsccaSm4/inc/internal/mcuxClOsccaSm4_Internal_Functions.h" projectpath="component/els_pkc/src/comps/mcuxClOsccaSm4/inc/internal"/>
        <file category="include" name="components/els_pkc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxClOsccaSm4/inc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxClOsccaSm4/inc/internal/"/>
      </files>
    </component>
    <component Cclass="MIMXRT758S els_pkc" Cgroup="els_pkc_padding" Cversion="1.9.0" condition="component.els_pkc.padding.condition_id">
      <description>Component els_pkc.padding</description>
      <files>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClPadding/src/mcuxClPadding.c" projectpath="component/els_pkc/src/comps/mcuxClPadding/src"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClPadding/inc/mcuxClPadding.h" projectpath="component/els_pkc/src/comps/mcuxClPadding/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClPadding/inc/mcuxClPadding_Constants.h" projectpath="component/els_pkc/src/comps/mcuxClPadding/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClPadding/inc/mcuxClPadding_Types.h" projectpath="component/els_pkc/src/comps/mcuxClPadding/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClPadding/inc/internal/mcuxClPadding_Functions_Internal.h" projectpath="component/els_pkc/src/comps/mcuxClPadding/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClPadding/inc/internal/mcuxClPadding_Internal.h" projectpath="component/els_pkc/src/comps/mcuxClPadding/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClPadding/inc/internal/mcuxClPadding_Types_Internal.h" projectpath="component/els_pkc/src/comps/mcuxClPadding/inc/internal"/>
        <file category="include" name="components/els_pkc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxClPadding/inc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxClPadding/inc/internal/"/>
      </files>
    </component>
    <component Cclass="MIMXRT758S els_pkc" Cgroup="els_pkc_param_integrity" Cversion="1.9.0" condition="component.els_pkc.param_integrity.condition_id">
      <description>Component els_pkc.param_integrity</description>
      <files>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxCsslParamIntegrity/src/mcuxCsslParamIntegrity32.c" projectpath="component/els_pkc/src/comps/mcuxCsslParamIntegrity/src"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxCsslParamIntegrity/inc/mcuxCsslParamIntegrity.h" projectpath="component/els_pkc/src/comps/mcuxCsslParamIntegrity/inc"/>
        <file category="include" name="components/els_pkc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxCsslParamIntegrity/inc/"/>
      </files>
    </component>
