vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MIMXRT758S_DFP.pdsc
    <component Cclass="MIMXRT758S els_pkc" Cgroup="els_pkc_pkc" Cversion="1.9.0" condition="component.els_pkc.pkc.condition_id">
      <description>Component pkc</description>
      <files>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClPkc/src/mcuxClPkc_Calculate.c" projectpath="component/els_pkc/src/comps/mcuxClPkc/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClPkc/src/mcuxClPkc_ImportExport.c" projectpath="component/els_pkc/src/comps/mcuxClPkc/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClPkc/src/mcuxClPkc_Initialize.c" projectpath="component/els_pkc/src/comps/mcuxClPkc/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClPkc/src/mcuxClPkc_UPTRT.c" projectpath="component/els_pkc/src/comps/mcuxClPkc/src"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClPkc/inc/mcuxClPkc.h" projectpath="component/els_pkc/src/comps/mcuxClPkc/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClPkc/inc/mcuxClPkc_Functions.h" projectpath="component/els_pkc/src/comps/mcuxClPkc/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClPkc/inc/mcuxClPkc_Types.h" projectpath="component/els_pkc/src/comps/mcuxClPkc/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClPkc/inc/internal/mcuxClPkc_FupMacros.h" projectpath="component/els_pkc/src/comps/mcuxClPkc/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClPkc/inc/internal/mcuxClPkc_ImportExport.h" projectpath="component/els_pkc/src/comps/mcuxClPkc/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClPkc/inc/internal/mcuxClPkc_Inline_Functions.h" projectpath="component/els_pkc/src/comps/mcuxClPkc/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClPkc/inc/internal/mcuxClPkc_Macros.h" projectpath="component/els_pkc/src/comps/mcuxClPkc/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClPkc/inc/internal/mcuxClPkc_Operations.h" projectpath="component/els_pkc/src/comps/mcuxClPkc/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClPkc/inc/internal/mcuxClPkc_Resource.h" projectpath="component/els_pkc/src/comps/mcuxClPkc/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClPkc/inc/internal/mcuxClPkc_SfrAccess.h" projectpath="component/els_pkc/src/comps/mcuxClPkc/inc/internal"/>
        <file category="include" name="components/els_pkc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxClPkc/inc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxClPkc/inc/internal/"/>
      </files>
    </component>
    <component Cclass="MIMXRT758S els_pkc" Cgroup="els_pkc_platform" Csub="mimxrt" Cversion="1.9.0" condition="component.els_pkc.platform.mimxrt.condition_id">
      <description>Component els_pkc_mimxrt</description>
      <files>
        <file category="header" name="components/els_pkc/src/platforms/mimxrt/platform_specific_headers.h" projectpath="component/els_pkc/src/platforms/mimxrt"/>
        <file category="header" name="components/els_pkc/src/platforms/mimxrt/mcuxClConfig.h" projectpath="component/els_pkc/src/platforms/mimxrt"/>
        <file category="header" name="components/els_pkc/src/platforms/mimxrt/inc/ip_css_constants.h" projectpath="component/els_pkc/src/platforms/mimxrt/inc"/>
        <file category="header" name="components/els_pkc/src/platforms/mimxrt/inc/ip_css_design_configuration.h" projectpath="component/els_pkc/src/platforms/mimxrt/inc"/>
        <file category="header" name="components/els_pkc/src/platforms/mimxrt/inc/ip_platform.h" projectpath="component/els_pkc/src/platforms/mimxrt/inc"/>
        <file category="sourceC" name="components/els_pkc/src/platforms/mimxrt/mcux_els.c" projectpath="component/els_pkc/src/platforms/mimxrt"/>
        <file category="header" name="components/els_pkc/src/platforms/mimxrt/mcux_els.h" projectpath="component/els_pkc/src/platforms/mimxrt"/>
        <file category="sourceC" name="components/els_pkc/src/platforms/mimxrt/mcux_pkc.c" projectpath="component/els_pkc/src/platforms/mimxrt"/>
        <file category="header" name="components/els_pkc/src/platforms/mimxrt/mcux_pkc.h" projectpath="component/els_pkc/src/platforms/mimxrt"/>
        <file category="header" name="components/els_pkc/includes/platform/mimxrt/mcuxClAeadModes_MemoryConsumption.h" projectpath="component/els_pkc/includes/platform/mimxrt"/>
        <file category="header" name="components/els_pkc/includes/platform/mimxrt/mcuxClCipherModes_MemoryConsumption.h" projectpath="component/els_pkc/includes/platform/mimxrt"/>
        <file category="header" name="components/els_pkc/includes/platform/mimxrt/mcuxClEcc_MemoryConsumption.h" projectpath="component/els_pkc/includes/platform/mimxrt"/>
        <file category="header" name="components/els_pkc/includes/platform/mimxrt/mcuxClHash_MemoryConsumption.h" projectpath="component/els_pkc/includes/platform/mimxrt"/>
        <file category="header" name="components/els_pkc/includes/platform/mimxrt/mcuxClHashModes_MemoryConsumption.h" projectpath="component/els_pkc/includes/platform/mimxrt"/>
        <file category="header" name="components/els_pkc/includes/platform/mimxrt/mcuxClHmac_MemoryConsumption.h" projectpath="component/els_pkc/includes/platform/mimxrt"/>
        <file category="header" name="components/els_pkc/includes/platform/mimxrt/mcuxClKey_MemoryConsumption.h" projectpath="component/els_pkc/includes/platform/mimxrt"/>
        <file category="header" name="components/els_pkc/includes/platform/mimxrt/mcuxClMacModes_MemoryConsumption.h" projectpath="component/els_pkc/includes/platform/mimxrt"/>
        <file category="header" name="components/els_pkc/includes/platform/mimxrt/mcuxClOsccaAeadModes_MemoryConsumption.h" projectpath="component/els_pkc/includes/platform/mimxrt"/>
        <file category="header" name="components/els_pkc/includes/platform/mimxrt/mcuxClOsccaCipherModes_MemoryConsumption.h" projectpath="component/els_pkc/includes/platform/mimxrt"/>
        <file category="header" name="components/els_pkc/includes/platform/mimxrt/mcuxClOsccaMacModes_MemoryConsumption.h" projectpath="component/els_pkc/includes/platform/mimxrt"/>
        <file category="header" name="components/els_pkc/includes/platform/mimxrt/mcuxClOsccaRandomModes_MemoryConsumption.h" projectpath="component/els_pkc/includes/platform/mimxrt"/>
        <file category="header" name="components/els_pkc/includes/platform/mimxrt/mcuxClOsccaSm2_MemoryConsumption.h" projectpath="component/els_pkc/includes/platform/mimxrt"/>
        <file category="header" name="components/els_pkc/includes/platform/mimxrt/mcuxClOsccaSm3_MemoryConsumption.h" projectpath="component/els_pkc/includes/platform/mimxrt"/>
        <file category="header" name="components/els_pkc/includes/platform/mimxrt/mcuxClRandomModes_MemoryConsumption.h" projectpath="component/els_pkc/includes/platform/mimxrt"/>
        <file category="header" name="components/els_pkc/includes/platform/mimxrt/mcuxClRsa_MemoryConsumption.h" projectpath="component/els_pkc/includes/platform/mimxrt"/>
        <file category="header" name="components/els_pkc/includes/platform/mimxrt/mcuxClSession_MemoryConsumption.h" projectpath="component/els_pkc/includes/platform/mimxrt"/>
        <file category="header" name="components/els_pkc/includes/platform/mimxrt/mcuxClSignature_MemoryConsumption.h" projectpath="component/els_pkc/includes/platform/mimxrt"/>
        <file category="include" name="components/els_pkc/"/>
        <file category="include" name="components/els_pkc/src/platforms/mimxrt/"/>
        <file category="include" name="components/els_pkc/src/platforms/mimxrt/inc/"/>
        <file category="include" name="components/els_pkc/includes/platform/mimxrt/"/>
      </files>
    </component>
    <component Cclass="MIMXRT758S els_pkc" Cgroup="els_pkc_pre_processor" Cversion="1.9.0" condition="component.els_pkc.pre_processor.condition_id">
      <description>Component els_pkc.pre_processor</description>
      <files>
        <file category="header" name="components/els_pkc/src/comps/mcuxCsslCPreProcessor/inc/mcuxCsslAnalysis.h" projectpath="component/els_pkc/src/comps/mcuxCsslCPreProcessor/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxCsslCPreProcessor/inc/mcuxCsslCPreProcessor.h" projectpath="component/els_pkc/src/comps/mcuxCsslCPreProcessor/inc"/>
        <file category="include" name="components/els_pkc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxCsslCPreProcessor/inc/"/>
      </files>
    </component>
    <component Cclass="MIMXRT758S els_pkc" Cgroup="els_pkc_prng" Cversion="1.9.0" condition="component.els_pkc.prng.condition_id">
      <description>Component prng</description>
      <files>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClPrng/src/mcuxClPrng_ELS.c" projectpath="component/els_pkc/src/comps/mcuxClPrng/src"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClPrng/inc/internal/mcuxClPrng_Internal.h" projectpath="component/els_pkc/src/comps/mcuxClPrng/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClPrng/inc/internal/mcuxClPrng_Internal_Constants.h" projectpath="component/els_pkc/src/comps/mcuxClPrng/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClPrng/inc/internal/mcuxClPrng_Internal_ELS.h" projectpath="component/els_pkc/src/comps/mcuxClPrng/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClPrng/inc/internal/mcuxClPrng_Internal_Functions.h" projectpath="component/els_pkc/src/comps/mcuxClPrng/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClPrng/inc/internal/mcuxClPrng_Internal_Types.h" projectpath="component/els_pkc/src/comps/mcuxClPrng/inc/internal"/>
        <file category="include" name="components/els_pkc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxClPrng/inc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxClPrng/inc/internal/"/>
      </files>
    </component>
