vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MIMXRT758S_DFP.pdsc
    <component Cclass="MIMXRT758S els_pkc" Cgroup="els_pkc_random_modes" Cversion="1.9.0" condition="component.els_pkc.random_modes.condition_id">
      <description>Component els_pkc.random_modes</description>
      <files>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClRandomModes/src/mcuxClRandomModes_CtrDrbg_Els.c" projectpath="component/els_pkc/src/comps/mcuxClRandomModes/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClRandomModes/src/mcuxClRandomModes_ElsMode.c" projectpath="component/els_pkc/src/comps/mcuxClRandomModes/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClRandomModes/src/mcuxClRandomModes_PatchMode.c" projectpath="component/els_pkc/src/comps/mcuxClRandomModes/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClRandomModes/src/mcuxClRandomModes_TestMode.c" projectpath="component/els_pkc/src/comps/mcuxClRandomModes/src"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClRandomModes/inc/mcuxClRandomModes.h" projectpath="component/els_pkc/src/comps/mcuxClRandomModes/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClRandomModes/inc/mcuxClRandomModes_Constants.h" projectpath="component/els_pkc/src/comps/mcuxClRandomModes/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClRandomModes/inc/mcuxClRandomModes_Functions_PatchMode.h" projectpath="component/els_pkc/src/comps/mcuxClRandomModes/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClRandomModes/inc/mcuxClRandomModes_Functions_TestMode.h" projectpath="component/els_pkc/src/comps/mcuxClRandomModes/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClRandomModes/inc/internal/mcuxClRandomModes_Internal_SizeDefinitions.h" projectpath="component/els_pkc/src/comps/mcuxClRandomModes/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClRandomModes/inc/internal/mcuxClRandomModes_Private_CtrDrbg.h" projectpath="component/els_pkc/src/comps/mcuxClRandomModes/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClRandomModes/inc/internal/mcuxClRandomModes_Private_CtrDrbg_BlockCipher.h" projectpath="component/els_pkc/src/comps/mcuxClRandomModes/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClRandomModes/inc/internal/mcuxClRandomModes_Private_Drbg.h" projectpath="component/els_pkc/src/comps/mcuxClRandomModes/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClRandomModes/inc/internal/mcuxClRandomModes_Private_NormalMode.h" projectpath="component/els_pkc/src/comps/mcuxClRandomModes/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClRandomModes/inc/internal/mcuxClRandomModes_Private_PatchMode.h" projectpath="component/els_pkc/src/comps/mcuxClRandomModes/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClRandomModes/inc/internal/mcuxClRandomModes_Private_PrDisabled.h" projectpath="component/els_pkc/src/comps/mcuxClRandomModes/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClRandomModes/inc/internal/mcuxClRandomModes_Private_TestMode.h" projectpath="component/els_pkc/src/comps/mcuxClRandomModes/inc/internal"/>
        <file category="include" name="components/els_pkc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxClRandomModes/inc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxClRandomModes/inc/internal/"/>
      </files>
    </component>
    <component Cclass="MIMXRT758S els_pkc" Cgroup="els_pkc_random_modes_ctr" Cversion="1.9.0" condition="component.els_pkc.random_modes_ctr.condition_id">
      <description>Component els_pkc.random_modes_ctr</description>
      <files>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClRandomModes/src/mcuxClRandomModes_CtrDrbg.c" projectpath="component/els_pkc/src/comps/mcuxClRandomModes/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClRandomModes/src/mcuxClRandomModes_CtrDrbg_PrDisabled.c" projectpath="component/els_pkc/src/comps/mcuxClRandomModes/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClRandomModes/src/mcuxClRandomModes_NormalMode.c" projectpath="component/els_pkc/src/comps/mcuxClRandomModes/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClRandomModes/src/mcuxClRandomModes_PrDisabled.c" projectpath="component/els_pkc/src/comps/mcuxClRandomModes/src"/>
        <file category="include" name="components/els_pkc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxClRandomModes/inc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxClRandomModes/inc/internal/"/>
      </files>
    </component>
    <component Cclass="MIMXRT758S els_pkc" Cgroup="els_pkc_random_modes_hmacdrbg" Cversion="1.9.0" condition="component.els_pkc.random_modes_hmacdrbg.condition_id">
      <description>Component els_pkc.random_modes_hmacdrbg</description>
      <files>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClRandomModes/src/mcuxClRandomModes_HmacDrbg.c" projectpath="component/els_pkc/src/comps/mcuxClRandomModes/src"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClRandomModes/inc/internal/mcuxClRandomModes_Internal_HmacDrbg_Functions.h" projectpath="component/els_pkc/src/comps/mcuxClRandomModes/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClRandomModes/inc/internal/mcuxClRandomModes_Private_HmacDrbg.h" projectpath="component/els_pkc/src/comps/mcuxClRandomModes/inc/internal"/>
        <file category="include" name="components/els_pkc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxClRandomModes/inc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxClRandomModes/inc/internal/"/>
      </files>
    </component>
