vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MIMXRT758S_DFP.pdsc
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="enable_pca9544" Cversion="1.0.0" condition="component.enable_pca9544.condition_id">
      <description>Component enable_pca9544</description>
      <RTE_Components_h>
#ifndef MCUX_ENABLE_PCA9544
#define MCUX_ENABLE_PCA9544 
#endif
</RTE_Components_h>
      <files>
        <file category="doc" name="components/i2c/muxes/component.enable_pca9544_dummy.txt"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="enable_pca9548" Cversion="1.0.0" condition="component.enable_pca9548.condition_id">
      <description>Component enable_pca9548</description>
      <RTE_Components_h>
#ifndef MCUX_ENABLE_PCA9548
#define MCUX_ENABLE_PCA9548 
#endif
</RTE_Components_h>
      <files>
        <file category="doc" name="components/i2c/muxes/component.enable_pca9548_dummy.txt"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="flash_nor_xspi" Cversion="1.0.0" condition="component.flash_nor_xspi.condition_id">
      <description>Component flash_nor_xspi</description>
      <files>
        <file category="header" name="components/flash/nor/fsl_nor_flash.h" projectpath="nor_flash/nor"/>
        <file category="sourceC" name="components/flash/nor/xspi/fsl_xspi_nor_flash.c" projectpath="nor_flash/nor/xspi"/>
        <file category="header" name="components/flash/nor/xspi/fsl_xspi_nor_flash.h" projectpath="nor_flash/nor/xspi"/>
        <file category="sourceC" name="components/flash/nor/fsl_sfdp_parser.c" projectpath="nor_flash/nor"/>
        <file category="header" name="components/flash/nor/fsl_sfdp_parser.h" projectpath="nor_flash/nor"/>
        <file category="include" name="components/flash/nor/"/>
        <file category="include" name="components/flash/nor/xspi/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="i2c_adapter_interface" Cversion="1.0.0" condition="component.i2c_adapter_interface.condition_id">
      <description>Component i2c_adapter_interface</description>
      <files>
        <file category="header" name="components/i2c/fsl_adapter_i2c.h" projectpath="component/i2c"/>
        <file category="include" name="components/i2c/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="i2c_mux" Cversion="1.0.0" condition="component.i2c_mux.condition_id">
      <description>Component i2c_mux</description>
      <files>
        <file category="doc" name="components/i2c/muxes/component.i2c_mux_dummy.txt"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="i2c_mux_pca954x" Cversion="1.0.0" condition="component.i2c_mux_pca954x.condition_id">
      <description>Component i2c_mux_pca954x</description>
      <files>
        <file category="header" name="components/i2c/muxes/fsl_pca954x.h" projectpath="component/i2c/muxes"/>
        <file category="sourceC" name="components/i2c/muxes/fsl_pca954x.c" projectpath="component/i2c/muxes"/>
        <file category="include" name="components/i2c/muxes/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="i3c_adapter" Cversion="1.0.0" condition="component.i3c_adapter.condition_id">
      <description>Component i3c_adapter</description>
      <RTE_Components_h>
        #ifndef SDK_I3C_BASED_COMPONENT_USED
        #define SDK_I3C_BASED_COMPONENT_USED 1
        #endif
      </RTE_Components_h>
      <files>
        <file category="sourceC" name="components/i2c/fsl_adapter_i3c.c" projectpath="component/i2c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="lists" Cversion="1.0.0" condition="component.lists.condition_id">
      <description>Component lists</description>
      <files>
        <file category="header" name="components/lists/fsl_component_generic_list.h" projectpath="component/lists"/>
        <file category="sourceC" name="components/lists/fsl_component_generic_list.c" projectpath="component/lists"/>
        <file category="include" name="components/lists/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="log" Cversion="1.0.0" condition="component.log.condition_id">
      <description>Component log</description>
      <files>
        <file category="header" name="components/log/fsl_component_log.h" projectpath="component/log"/>
        <file category="sourceC" name="components/log/fsl_component_log.c" projectpath="component/log"/>
        <file category="header" name="components/log/fsl_component_log_config.h" projectpath="component/log"/>
        <file category="include" name="components/log/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="debugconsole" Cversion="1.0.0" condition="component.log.backend.debug_console.condition_id">
      <description>Component log backend debug console</description>
      <files>
        <file category="header" name="components/log/fsl_component_log_backend_debugconsole.h" projectpath="component/log"/>
        <file category="sourceC" name="components/log/fsl_component_log_backend_debugconsole.c" projectpath="component/log"/>
        <file category="include" name="components/log/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="debugconsole_lite" Cversion="1.0.0" condition="component.log.backend.debug_console_lite.condition_id">
      <description>Component log backend debug console lite</description>
      <files>
        <file category="header" name="components/log/fsl_component_log_backend_debugconsole.h" projectpath="component/log"/>
        <file category="sourceC" name="components/log/fsl_component_log_backend_debugconsole.c" projectpath="component/log"/>
        <file category="include" name="components/log/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="ringbuffer" Cversion="1.0.0" condition="component.log.backend.ringbuffer.condition_id">
      <description>Component log backend ring buffer</description>
      <files>
        <file category="header" name="components/log/fsl_component_log_backend_ringbuffer.h" projectpath="component/log"/>
        <file category="sourceC" name="components/log/fsl_component_log_backend_ringbuffer.c" projectpath="component/log"/>
        <file category="include" name="components/log/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="lpi2c_adapter" Cversion="1.0.0" condition="component.lpi2c_adapter.condition_id">
      <description>Component lpi2c_adapter</description>
      <files>
        <file category="sourceC" name="components/i2c/fsl_adapter_lpi2c.c" projectpath="component/i2c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="lpuart_adapter" Cversion="1.0.0" condition="component.lpuart_adapter.condition_id">
      <description>Component lpuart_adapter</description>
      <files>
        <file category="header" name="components/uart/fsl_adapter_uart.h" projectpath="component/uart"/>
        <file category="sourceC" name="components/uart/fsl_adapter_lpuart.c" projectpath="component/uart"/>
        <file category="include" name="components/uart/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="mflash_offchip" Cversion="1.0.0" condition="component.mflash_offchip.condition_id">
      <description>mflash offchip</description>
      <RTE_Components_h>
#ifndef MFLASH_FILE_BASEADDR
#define MFLASH_FILE_BASEADDR 7340032
#endif
</RTE_Components_h>
      <files>
        <file category="header" name="components/flash/mflash/mflash_common.h" projectpath="flash/mflash"/>
        <file category="sourceC" name="components/flash/mflash/mflash_file.c" projectpath="flash/mflash"/>
        <file category="header" name="components/flash/mflash/mflash_file.h" projectpath="flash/mflash"/>
        <file category="sourceC" name="components/flash/mflash/mimxrt700/mflash_drv.c" projectpath="flash/mflash/mimxrt700"/>
        <file category="header" name="components/flash/mflash/mimxrt700/mflash_drv.h" projectpath="flash/mflash/mimxrt700"/>
        <file category="include" name="components/flash/mflash/"/>
        <file category="include" name="components/flash/mflash/mimxrt700/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="mflash_onchip" Cversion="1.0.0" condition="component.mflash_onchip.condition_id">
      <description>mflash onchip</description>
      <files>
        <file category="doc" name="components/flash/mflash/component.mflash_onchip_dummy.txt"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="mflash_onchip_fmu" Cversion="1.0.0" condition="component.mflash_onchip_fmu.condition_id">
      <description>mflash onchip_fmu</description>
      <files>
        <file category="doc" name="components/flash/mflash/component.mflash_onchip_fmu_dummy.txt"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="mrt_adapter" Cversion="1.0.0" condition="component.mrt_adapter.condition_id">
      <description>Component mrt_adapter</description>
      <RTE_Components_h>
#ifndef TIMER_PORT_TYPE_MRT
#define TIMER_PORT_TYPE_MRT 1
#endif
</RTE_Components_h>
      <files>
        <file category="header" name="components/timer/fsl_adapter_timer.h" projectpath="component/timer"/>
        <file category="sourceC" name="components/timer/fsl_adapter_mrt.c" projectpath="component/timer"/>
        <file category="include" name="components/timer/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="ostimer_adapter" Cversion="1.0.0" condition="component.ostimer_adapter.condition_id">
      <description>Component ostimer_adapter</description>
      <RTE_Components_h>
#ifndef TIMER_PORT_TYPE_OSTIMER
#define TIMER_PORT_TYPE_OSTIMER 1
#endif
</RTE_Components_h>
      <files>
        <file category="header" name="components/timer/fsl_adapter_timer.h" projectpath="component/timer"/>
        <file category="sourceC" name="components/timer/fsl_adapter_ostimer.c" projectpath="component/timer"/>
        <file category="include" name="components/timer/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="panic" Cversion="1.0.0" condition="component.panic.condition_id">
      <description>Component panic</description>
      <files>
        <file category="header" name="components/panic/fsl_component_panic.h" projectpath="component/panic"/>
        <file category="sourceC" name="components/panic/fsl_component_panic.c" projectpath="component/panic"/>
        <file category="include" name="components/panic/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="pcm186x_adapter" Cversion="2.0.0" condition="component.pcm186x_adapter.condition_id">
      <description>Component pcm186x adapter for single codec</description>
      <files>
        <file category="header" name="components/codec/port/pcm186x/fsl_codec_pcm186x_adapter.h" projectpath="codec/port/pcm186x"/>
        <file category="sourceC" name="components/codec/port/pcm186x/fsl_codec_pcm186x_adapter.c" projectpath="codec/port/pcm186x"/>
        <file category="header" name="components/codec/port/fsl_codec_adapter.h" projectpath="codec/port"/>
        <file category="include" name="components/codec/port/pcm186x/"/>
        <file category="include" name="components/codec/port/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="pcm512x_adapter" Cversion="2.0.0" condition="component.pcm512x_adapter.condition_id">
      <description>Component pcm512x adapter for single codec</description>
      <files>
        <file category="header" name="components/codec/port/pcm512x/fsl_codec_pcm512x_adapter.h" projectpath="codec/port/pcm512x"/>
        <file category="sourceC" name="components/codec/port/pcm512x/fsl_codec_pcm512x_adapter.c" projectpath="codec/port/pcm512x"/>
        <file category="header" name="components/codec/port/fsl_codec_adapter.h" projectpath="codec/port"/>
        <file category="include" name="components/codec/port/pcm512x/"/>
        <file category="include" name="components/codec/port/"/>
      </files>
    </component>
