vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MIMXRT758S_DFP.pdsc
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="trng_adapter" Cversion="1.0.0" condition="component.trng_adapter.condition_id">
      <description>Component trng_adapter</description>
      <files>
        <file category="sourceC" name="components/rng/fsl_adapter_trng.c" projectpath="component/rng"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="wm8524_adapter" Cversion="2.2.0" condition="component.wm8524_adapter.condition_id">
      <description>Component wm8524 adapter for single codec</description>
      <files>
        <file category="header" name="components/codec/port/wm8524/fsl_codec_wm8524_adapter.h" projectpath="codec/port/wm8524"/>
        <file category="sourceC" name="components/codec/port/wm8524/fsl_codec_wm8524_adapter.c" projectpath="codec/port/wm8524"/>
        <file category="header" name="components/codec/port/fsl_codec_adapter.h" projectpath="codec/port"/>
        <file category="include" name="components/codec/port/wm8524/"/>
        <file category="include" name="components/codec/port/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="wm8904_adapter" Cversion="2.2.0" condition="component.wm8904_adapter.condition_id">
      <description>Component wm8904 adapter for single codec</description>
      <files>
        <file category="header" name="components/codec/port/wm8904/fsl_codec_wm8904_adapter.h" projectpath="codec/port/wm8904"/>
        <file category="sourceC" name="components/codec/port/wm8904/fsl_codec_wm8904_adapter.c" projectpath="codec/port/wm8904"/>
        <file category="header" name="components/codec/port/fsl_codec_adapter.h" projectpath="codec/port"/>
        <file category="include" name="components/codec/port/wm8904/"/>
        <file category="include" name="components/codec/port/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="wm8960_adapter" Cversion="2.2.0" condition="component.wm8960_adapter.condition_id">
      <description>Component wm8960 adapter for single codecs</description>
      <files>
        <file category="header" name="components/codec/port/wm8960/fsl_codec_wm8960_adapter.h" projectpath="codec/port/wm8960"/>
        <file category="sourceC" name="components/codec/port/wm8960/fsl_codec_wm8960_adapter.c" projectpath="codec/port/wm8960"/>
        <file category="header" name="components/codec/port/fsl_codec_adapter.h" projectpath="codec/port"/>
        <file category="include" name="components/codec/port/wm8960/"/>
        <file category="include" name="components/codec/port/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="wm8962_adapter" Cversion="2.2.0" condition="component.wm8962_adapter.condition_id">
      <description>Component wm8962 adapter for single codecs</description>
      <files>
        <file category="header" name="components/codec/port/wm8962/fsl_codec_wm8962_adapter.h" projectpath="codec/port/wm8962"/>
        <file category="sourceC" name="components/codec/port/wm8962/fsl_codec_wm8962_adapter.c" projectpath="codec/port/wm8962"/>
        <file category="header" name="components/codec/port/fsl_codec_adapter.h" projectpath="codec/port"/>
        <file category="include" name="components/codec/port/wm8962/"/>
        <file category="include" name="components/codec/port/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="CMSIS" Csub="MIMXRT758S_header" Cversion="1.0.0" condition="device.CMSIS.condition_id">
      <description>Device MIMXRT758S_cmsis</description>
      <files>
        <file category="header" name="devices/MIMXRT758S/fsl_device_registers.h" projectpath="device"/>
        <file condition="allOf.core_ids=cm33_core0.condition_id" category="header" name="devices/MIMXRT758S/MIMXRT758S_cm33_core0.h" projectpath="device"/>
        <file condition="allOf.core_ids=cm33_core0.condition_id" category="header" name="devices/MIMXRT758S/MIMXRT758S_cm33_core0_COMMON.h" projectpath="device"/>
        <file condition="allOf.core_ids=cm33_core0.condition_id" category="header" name="devices/MIMXRT758S/MIMXRT758S_cm33_core0_features.h" projectpath="device"/>
        <file category="header" name="devices/MIMXRT758S/periph/PERI_ADC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT758S/periph/PERI_AHBSC0.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT758S/periph/PERI_AHBSC3.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT758S/periph/PERI_AHBSC4.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT758S/periph/PERI_CACHE64_CTRL.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT758S/periph/PERI_CACHE64_POLSEL.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT758S/periph/PERI_CDOG.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT758S/periph/PERI_CLKCTL0.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT758S/periph/PERI_CLKCTL1.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT758S/periph/PERI_CLKCTL2.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT758S/periph/PERI_CLKCTL3.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT758S/periph/PERI_CLKCTL4.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT758S/periph/PERI_CMP.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT758S/periph/PERI_CRC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT758S/periph/PERI_CTIMER.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT758S/periph/PERI_DEBUG_MAILBOX.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT758S/periph/PERI_DMA.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT758S/periph/PERI_ELS.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT758S/periph/PERI_FLEXIO.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT758S/periph/PERI_FREQME.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT758S/periph/PERI_FRO.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT758S/periph/PERI_GDET.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT758S/periph/PERI_GLIKEY.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT758S/periph/PERI_GPIO.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT758S/periph/PERI_I2S.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT758S/periph/PERI_I3C.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT758S/periph/PERI_INPUTMUX0.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT758S/periph/PERI_INPUTMUX1.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT758S/periph/PERI_IOPCTL0.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT758S/periph/PERI_IOPCTL1.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT758S/periph/PERI_IOPCTL2.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT758S/periph/PERI_ITRC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT758S/periph/PERI_JPEGDEC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT758S/periph/PERI_JPGDECWRP.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT758S/periph/PERI_LCDIF.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT758S/periph/PERI_LPI2C.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT758S/periph/PERI_LPSPI.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT758S/periph/PERI_LPUART.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT758S/periph/PERI_LP_FLEXCOMM.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT758S/periph/PERI_MIPI_DSI_HOST.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT758S/periph/PERI_MMU.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT758S/periph/PERI_MRT.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT758S/periph/PERI_MU.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT758S/periph/PERI_NIC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT758S/periph/PERI_OCOTP.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT758S/periph/PERI_OSC32KNP.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT758S/periph/PERI_OSCCA.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT758S/periph/PERI_OSTIMER.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT758S/periph/PERI_PDM.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT758S/periph/PERI_PINT.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT758S/periph/PERI_PKC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT758S/periph/PERI_PMC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT758S/periph/PERI_PNGDEC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT758S/periph/PERI_PUF.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT758S/periph/PERI_PVTS.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT758S/periph/PERI_ROMCP.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT758S/periph/PERI_RSTCTL0.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT758S/periph/PERI_RSTCTL1.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT758S/periph/PERI_RSTCTL2.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT758S/periph/PERI_RSTCTL3.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT758S/periph/PERI_RSTCTL4.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT758S/periph/PERI_RTC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT758S/periph/PERI_SCT.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT758S/periph/PERI_SDADC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT758S/periph/PERI_SEMA42.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT758S/periph/PERI_SLEEPCON0.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT758S/periph/PERI_SLEEPCON1.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT758S/periph/PERI_SYSCON0.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT758S/periph/PERI_SYSCON1.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT758S/periph/PERI_SYSCON2.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT758S/periph/PERI_SYSCON3.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT758S/periph/PERI_SYSCON4.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT758S/periph/PERI_SYSPM.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT758S/periph/PERI_TRNG.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT758S/periph/PERI_USB.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT758S/periph/PERI_USBHSDCD.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT758S/periph/PERI_USBNC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT758S/periph/PERI_USBPHY.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT758S/periph/PERI_USDHC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT758S/periph/PERI_UTICK.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT758S/periph/PERI_WWDT.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT758S/periph/PERI_XCACHE.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT758S/periph/PERI_XSPI.h" projectpath="device/periph"/>
        <file condition="allOf.core_ids=cm33_core1.condition_id" category="header" name="devices/MIMXRT758S/MIMXRT758S_cm33_core1.h" projectpath="device"/>
        <file condition="allOf.core_ids=cm33_core1.condition_id" category="header" name="devices/MIMXRT758S/MIMXRT758S_cm33_core1_COMMON.h" projectpath="device"/>
        <file condition="allOf.core_ids=cm33_core1.condition_id" category="header" name="devices/MIMXRT758S/MIMXRT758S_cm33_core1_features.h" projectpath="device"/>
        <file category="include" name="devices/MIMXRT758S/"/>
        <file category="include" name="devices/MIMXRT758S/periph/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device" Cversion="1.0.0" condition="device.RTE.condition_id">
      <description>Rte_device</description>
      <files>
        <file category="header" attr="config" name="devices/MIMXRT758S/template/RTE_Device.h" version="1.0.0" projectpath="board"/>
        <file category="include" name="devices/MIMXRT758S/template/"/>
      </files>
    </component>
