vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MIMXRT758S_DFP.pdsc
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="MIMXRT758S_linker" Cversion="1.0.0" condition="device.linker.condition_id">
      <description>Device MIMXRT758S_linker</description>
      <files>
        <file condition="allOf.toolchains=mdk, cores=cm33, core_ids=cm33_core0, device_ids=MIMXRT758S.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT758S/arm/MIMXRT758Sxxxx_cm33_core0_ram.scf" version="1.0.0" projectpath="MIMXRT758S/arm"/>
        <file condition="allOf.toolchains=mdk, cores=cm33, core_ids=cm33_core0, device_ids=MIMXRT758S.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT758S/arm/MIMXRT758Sxxxx_cm33_core0_flash.scf" version="1.0.0" projectpath="MIMXRT758S/arm"/>
        <file condition="allOf.toolchains=mdk, cores=cm33, core_ids=cm33_core0, device_ids=MIMXRT758S.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT758S/arm/MIMXRT758Sxxxx_cm33_core0_flash1.scf" version="1.0.0" projectpath="MIMXRT758S/arm"/>
        <file condition="allOf.toolchains=armgcc, cores=cm33, core_ids=cm33_core0, device_ids=MIMXRT758S.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT758S/gcc/MIMXRT758Sxxxx_cm33_core0_ram.ld" version="1.0.0" projectpath="MIMXRT758S/gcc"/>
        <file condition="allOf.toolchains=armgcc, cores=cm33, core_ids=cm33_core0, device_ids=MIMXRT758S.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT758S/gcc/MIMXRT758Sxxxx_cm33_core0_flash.ld" version="1.0.0" projectpath="MIMXRT758S/gcc"/>
        <file condition="allOf.toolchains=armgcc, cores=cm33, core_ids=cm33_core0, device_ids=MIMXRT758S.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT758S/gcc/MIMXRT758Sxxxx_cm33_core0_flash1.ld" version="1.0.0" projectpath="MIMXRT758S/gcc"/>
        <file condition="allOf.toolchains=iar, cores=cm33, core_ids=cm33_core0, device_ids=MIMXRT758S.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT758S/iar/MIMXRT758Sxxxx_cm33_core0_ram.icf" version="1.0.0" projectpath="MIMXRT758S/iar"/>
        <file condition="allOf.toolchains=iar, cores=cm33, core_ids=cm33_core0, device_ids=MIMXRT758S.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT758S/iar/MIMXRT758Sxxxx_cm33_core0_flash.icf" version="1.0.0" projectpath="MIMXRT758S/iar"/>
        <file condition="allOf.toolchains=iar, cores=cm33, core_ids=cm33_core0, device_ids=MIMXRT758S.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT758S/iar/MIMXRT758Sxxxx_cm33_core0_flash1.icf" version="1.0.0" projectpath="MIMXRT758S/iar"/>
        <file condition="allOf.toolchains=mdk, cores=cm33, core_ids=cm33_core1, device_ids=MIMXRT758S.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT758S/arm/MIMXRT758Sxxxx_cm33_core1_ram.scf" version="1.0.0" projectpath="MIMXRT758S/arm"/>
        <file condition="allOf.toolchains=armgcc, cores=cm33, core_ids=cm33_core1, device_ids=MIMXRT758S.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT758S/gcc/MIMXRT758Sxxxx_cm33_core1_ram.ld" version="1.0.0" projectpath="MIMXRT758S/gcc"/>
        <file condition="allOf.toolchains=iar, cores=cm33, core_ids=cm33_core1, device_ids=MIMXRT758S.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT758S/iar/MIMXRT758Sxxxx_cm33_core1_ram.icf" version="1.0.0" projectpath="MIMXRT758S/iar"/>
      </files>
    </component>
    <component Cclass="Board Support" Cgroup="SDK Project Template" Csub="project_template" Cvariant="MIMXRT758S" Cversion="1.0.0" condition="device.project_template.condition_id" isDefaultVariant="1">
      <description>Devices_project_template MIMXRT758S</description>
      <files>
        <file category="header" attr="config" name="devices/MIMXRT758S/project_template/board.h" version="1.0.0" projectpath="board"/>
        <file category="sourceC" attr="config" name="devices/MIMXRT758S/project_template/board.c" version="1.0.0" projectpath="board"/>
        <file condition="allOf.core_ids=cm33_core0.condition_id" category="header" attr="config" name="devices/MIMXRT758S/project_template/cm33_core0/clock_config.h" version="1.0.0" projectpath="board/cm33_core0" path="devices/MIMXRT758S/project_template"/>
        <file condition="allOf.core_ids=cm33_core0.condition_id" category="sourceC" attr="config" name="devices/MIMXRT758S/project_template/cm33_core0/clock_config.c" version="1.0.0" projectpath="board/cm33_core0"/>
        <file condition="allOf.core_ids=cm33_core1.condition_id" category="header" attr="config" name="devices/MIMXRT758S/project_template/cm33_core1/clock_config.h" version="1.0.0" projectpath="board/cm33_core1" path="devices/MIMXRT758S/project_template"/>
        <file condition="allOf.core_ids=cm33_core1.condition_id" category="sourceC" attr="config" name="devices/MIMXRT758S/project_template/cm33_core1/clock_config.c" version="1.0.0" projectpath="board/cm33_core1"/>
        <file condition="allOf.core_ids=cm33_core0.condition_id" category="header" attr="config" name="devices/MIMXRT758S/project_template/cm33_core0/pin_mux.h" version="1.0.0" projectpath="board/cm33_core0" path="devices/MIMXRT758S/project_template"/>
        <file condition="allOf.core_ids=cm33_core0.condition_id" category="sourceC" attr="config" name="devices/MIMXRT758S/project_template/cm33_core0/pin_mux.c" version="1.0.0" projectpath="board/cm33_core0"/>
        <file condition="allOf.core_ids=cm33_core1.condition_id" category="header" attr="config" name="devices/MIMXRT758S/project_template/cm33_core1/pin_mux.h" version="1.0.0" projectpath="board/cm33_core1" path="devices/MIMXRT758S/project_template"/>
        <file condition="allOf.core_ids=cm33_core1.condition_id" category="sourceC" attr="config" name="devices/MIMXRT758S/project_template/cm33_core1/pin_mux.c" version="1.0.0" projectpath="board/cm33_core1"/>
        <file condition="allOf.core_ids=cm33_core0.condition_id" category="header" attr="config" name="devices/MIMXRT758S/project_template/cm33_core0/peripherals.h" version="1.0.0" projectpath="board/cm33_core0" path="devices/MIMXRT758S/project_template"/>
        <file condition="allOf.core_ids=cm33_core0.condition_id" category="sourceC" attr="config" name="devices/MIMXRT758S/project_template/cm33_core0/peripherals.c" version="1.0.0" projectpath="board/cm33_core0"/>
        <file condition="allOf.core_ids=cm33_core1.condition_id" category="header" attr="config" name="devices/MIMXRT758S/project_template/cm33_core1/peripherals.h" version="1.0.0" projectpath="board/cm33_core1" path="devices/MIMXRT758S/project_template"/>
        <file condition="allOf.core_ids=cm33_core1.condition_id" category="sourceC" attr="config" name="devices/MIMXRT758S/project_template/cm33_core1/peripherals.c" version="1.0.0" projectpath="board/cm33_core1"/>
        <file category="include" name="devices/MIMXRT758S/project_template/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="Startup" Csub="" Cversion="1.0.0" condition="device.startup.condition_id">
      <description>Device MIMXRT758S_startup</description>
      <files>
        <file condition="allOf.toolchains=armgcc, iar, mdk, core_ids=cm33_core0.condition_id" category="sourceC" attr="config" name="devices/MIMXRT758S/startup_MIMXRT758S_cm33_core0.c" version="1.0.0" projectpath="startup"/>
        <file condition="allOf.toolchains=armgcc, iar, mdk, core_ids=cm33_core1.condition_id" category="sourceC" attr="config" name="devices/MIMXRT758S/startup_MIMXRT758S_cm33_core1.c" version="1.0.0" projectpath="startup"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="CMSIS" Csub="MIMXRT758S_system" Cversion="1.0.0" condition="device.system.condition_id">
      <description>Device MIMXRT758S_system</description>
      <files>
        <file condition="allOf.core_ids=cm33_core0.condition_id" category="sourceC" name="devices/MIMXRT758S/system_MIMXRT758S_cm33_core0.c" projectpath="device"/>
        <file condition="allOf.core_ids=cm33_core0.condition_id" category="header" name="devices/MIMXRT758S/system_MIMXRT758S_cm33_core0.h" projectpath="device"/>
        <file condition="allOf.core_ids=cm33_core1.condition_id" category="sourceC" name="devices/MIMXRT758S/system_MIMXRT758S_cm33_core1.c" projectpath="device"/>
        <file condition="allOf.core_ids=cm33_core1.condition_id" category="header" name="devices/MIMXRT758S/system_MIMXRT758S_cm33_core1.h" projectpath="device"/>
        <file category="include" name="devices/MIMXRT758S/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="acmp" Cversion="2.3.0" condition="driver.acmp.condition_id">
      <description>ACMP Driver</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT758S/drivers/fsl_acmp.c" projectpath="drivers"/>
        <file category="header" name="devices/MIMXRT758S/drivers/fsl_acmp.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT758S/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="ak4497" Cversion="2.1.2" condition="driver.ak4497.condition_id">
      <description>Driver ak4497</description>
      <RTE_Components_h>
#ifndef CODEC_AK4497_ENABLE
#define CODEC_AK4497_ENABLE 
#endif
</RTE_Components_h>
      <files>
        <file category="header" name="components/codec/ak4497/fsl_ak4497.h" projectpath="codec"/>
        <file category="sourceC" name="components/codec/ak4497/fsl_ak4497.c" projectpath="codec"/>
        <file category="include" name="components/codec/ak4497/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="cache_xcache" Cversion="2.0.3" condition="driver.cache_xcache.condition_id">
      <description>CACHE XCACHE Driver</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT758S/drivers/fsl_cache.c" projectpath="drivers"/>
        <file category="header" name="devices/MIMXRT758S/drivers/fsl_cache.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT758S/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="cdog" Cversion="2.1.3" condition="driver.cdog.condition_id">
      <description>cdog Driver</description>
      <files>
        <file category="header" name="devices/MIMXRT758S/drivers/fsl_cdog.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MIMXRT758S/drivers/fsl_cdog.c" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT758S/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="clock" Cversion="2.5.0" condition="driver.clock.condition_id">
      <description>Clock Driver</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT758S/drivers/fsl_clock.c" projectpath="drivers"/>
        <file category="header" name="devices/MIMXRT758S/drivers/fsl_clock.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT758S/drivers/"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="I2C" Csub="lpi2c_cmsis" Cversion="2.6.0" Capiversion="2.3.0" condition="driver.cmsis_lpi2c.condition_id">
      <description>LPI2C CMSIS Driver</description>
      <files>
        <file category="header" name="devices/MIMXRT758S/cmsis_drivers/fsl_lpi2c_cmsis.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MIMXRT758S/cmsis_drivers/fsl_lpi2c_cmsis.c" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT758S/cmsis_drivers/"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="SPI" Csub="lpspi_cmsis" Cversion="2.12.0" Capiversion="2.2.0" condition="driver.cmsis_lpspi.condition_id">
      <description>LPSPI CMSIS Driver</description>
      <files>
        <file category="header" name="devices/MIMXRT758S/cmsis_drivers/fsl_lpspi_cmsis.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MIMXRT758S/cmsis_drivers/fsl_lpspi_cmsis.c" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT758S/cmsis_drivers/"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="USART" Csub="lpuart_cmsis" Cversion="2.7.0" Capiversion="2.3.0" condition="driver.cmsis_lpuart.condition_id">
      <description>LPUART CMSIS Driver</description>
      <files>
        <file category="header" name="devices/MIMXRT758S/cmsis_drivers/fsl_lpuart_cmsis.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MIMXRT758S/cmsis_drivers/fsl_lpuart_cmsis.c" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT758S/cmsis_drivers/"/>
      </files>
    </component>
