vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MIMXRT758S_DFP.pdsc
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="pngdec" Cversion="2.0.1" condition="driver.pngdec.condition_id">
      <description>PNGDEC Driver</description>
      <files>
        <file category="header" name="devices/MIMXRT758S/drivers/fsl_pngdec.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MIMXRT758S/drivers/fsl_pngdec.c" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT758S/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="power" Cversion="2.4.2" condition="driver.power.condition_id">
      <description>Power driver</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT758S/drivers/fsl_power.c" projectpath="drivers"/>
        <file category="header" name="devices/MIMXRT758S/drivers/fsl_power.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT758S/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="psp27801" Cversion="1.0.0" condition="driver.psp27801.condition_id">
      <description>Driver psp27801</description>
      <files>
        <file category="header" name="components/display/psp27801/fsl_psp27801.h" projectpath="oled"/>
        <file category="sourceC" name="components/display/psp27801/fsl_psp27801.c" projectpath="oled"/>
        <file category="include" name="components/display/psp27801/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="PUFv3" Cversion="2.0.3" condition="driver.puf_v3.condition_id">
      <description>PUFv3 Driver</description>
      <files>
        <file category="header" name="devices/MIMXRT758S/drivers/fsl_puf_v3.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MIMXRT758S/drivers/fsl_puf_v3.c" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT758S/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="pvts" Cversion="2.0.2" condition="driver.pvts.condition_id">
      <description>PVTS driver</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT758S/drivers/fsl_pvts.c" projectpath="drivers"/>
        <file category="header" name="devices/MIMXRT758S/drivers/fsl_pvts.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT758S/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="reset" Cversion="2.1.0" condition="driver.reset.condition_id">
      <description>Reset Driver</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT758S/drivers/fsl_reset.c" projectpath="drivers"/>
        <file category="header" name="devices/MIMXRT758S/drivers/fsl_reset.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT758S/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="romapi" Cversion="2.1.0" condition="driver.romapi.condition_id">
      <description>ROMAPI Driver</description>
      <files>
        <file category="header" name="devices/MIMXRT758S/drivers/romapi/bootloader/fsl_romapi.h" projectpath="drivers/romapi/bootloader"/>
        <file category="sourceC" name="devices/MIMXRT758S/drivers/romapi/bootloader/fsl_romapi.c" projectpath="drivers/romapi/bootloader"/>
        <file category="header" name="devices/MIMXRT758S/drivers/romapi/otp/fsl_romapi_otp.h" projectpath="drivers/romapi/otp"/>
        <file category="sourceC" name="devices/MIMXRT758S/drivers/romapi/otp/fsl_romapi_otp.c" projectpath="drivers/romapi/otp"/>
        <file category="header" name="devices/MIMXRT758S/drivers/romapi/nboot/fsl_romapi_nboot.h" projectpath="drivers/romapi/nboot"/>
        <file category="sourceC" name="devices/MIMXRT758S/drivers/romapi/nboot/fsl_romapi_nboot.c" projectpath="drivers/romapi/nboot"/>
        <file category="header" name="devices/MIMXRT758S/drivers/romapi/iap/fsl_romapi_iap.h" projectpath="drivers/romapi/iap"/>
        <file category="sourceC" name="devices/MIMXRT758S/drivers/romapi/iap/fsl_romapi_iap.c" projectpath="drivers/romapi/iap"/>
        <file category="header" name="devices/MIMXRT758S/drivers/romapi/iap/fsl_sbloader_v3.h" projectpath="drivers/romapi/iap"/>
        <file category="include" name="devices/MIMXRT758S/drivers/romapi/"/>
        <file category="include" name="devices/MIMXRT758S/drivers/romapi/bootloader/"/>
        <file category="include" name="devices/MIMXRT758S/drivers/romapi/nboot/"/>
        <file category="include" name="devices/MIMXRT758S/drivers/romapi/iap/"/>
        <file category="include" name="devices/MIMXRT758S/drivers/romapi/otp/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="sai" Cversion="2.4.8" condition="driver.sai.condition_id">
      <description>SAI Driver</description>
      <files>
        <file category="header" name="devices/MIMXRT758S/drivers/fsl_sai.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MIMXRT758S/drivers/fsl_sai.c" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT758S/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="sai_edma" Cversion="2.7.3" condition="driver.sai_edma.condition_id">
      <description>SAI EDMA Driver</description>
      <files>
        <file category="header" name="devices/MIMXRT758S/drivers/fsl_sai_edma.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MIMXRT758S/drivers/fsl_sai_edma.c" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT758S/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="sctimer" Cversion="2.5.1" condition="driver.sctimer.condition_id">
      <description>SCT Driver</description>
      <files>
        <file category="header" name="devices/MIMXRT758S/drivers/fsl_sctimer.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MIMXRT758S/drivers/fsl_sctimer.c" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT758S/drivers/"/>
      </files>
    </component>
